[
    {
        "document_title": "Additional Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17342&returnto=3362",
        "document_content": " Medical Professions Advisement"
    },
    {
        "document_title": "Additional Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17342&returnto=3362",
        "document_content": "Department Information Office of Medical Professions Advisement Program PO Box 70592 Johnson City, TN 37614 Phone: (423) 439-5602 Web address: https://www.etsu.edu/cas/case/mpa/ Medical Professions Advisementin the College of Arts and Sciences provides advisement and counseling to students entering East Tennessee State University in preparation for careers in the following health-related fields: chiropractic, dentistry, medicine (allopathic or osteopathic), optometry, pharmacy, physician assistant, podiatry, and veterinary medicine. These pre-professional tracks are not undergraduate majors at ETSU, but tracksthat prepare students for application to professional programs. Many professional programs prefer/require that studentsearn an undergraduate degree before acceptance into their programs. Therefore, the student, medical professions counselor, and major advisor work in conjunction to develop a plan of study that fulfills the requirements for an undergraduate degree and prerequisite courses for the students professional school(s) of choice. Students are encouraged to choose a majorthat interests them and supports their career and personal goals. Questions concerning health-related pre-professional tracksshould be directed to the Office of Medical Professions Advisement at (423) 439-5602 . For more information on themedical professions tracks listed below pleasevisit: https://www.etsu.edu/cas/case/mpa/ . Pre-Medicine Pre-Optometry Pre-Pharmacy Pre-Physician Assistant Pre-Podiatry Pre-Chiropractic Pre-Veterinary Medicine Pre-Dentistry Medical Professions Advisement"
    },
    {
        "document_title": "Additional Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17109&returnto=3362",
        "document_content": " Military Science Program (Four-Year Program)"
    },
    {
        "document_title": "Additional Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17109&returnto=3362",
        "document_content": "Military Science Program Information Department of Military Science POBox 70648 Phone: (423) 439-4269 Web Address: www.etsu.edu/cbat/rotc/ The military science program is a cooperative enterprise between ETSU and the United States Army. The program is designed to develop the students managerial and leadership abilities, introduce students to the mission and organization of the United States Army and prepare advanced-course students for service as commissioned officers in the Active Army, Army Reserve or Army National Guard. Major An academic major in military science is not offered at ETSU. However, completion of the program qualifies the student for a commission as a second lieutenant. Course Credit Students interested in participating in the advanced phase may receive basic phase credit for having prior active or reserve component military service, three years of junior ROTC at the high school level, or for completion of ROTC Leaders Training Course (LTC). ROTC Basic Course Any student may enroll without obligation in the Department of Military Sciences Basic Course Classes. Those classes listed as 1200- and 2100-series classes are considered part of the Basic Course of military science. Students desiring to enter the Advanced Course of the ROTC program through the four-year program must complete all four Basic Course Classes. In certain cases, the professor of Military Science may waive one of these class requirements. The basic phase is designed to introduce the United States Army as an institution, the military as a profession, and to impart to all students basic leadership skills which can be used in a civilian environment as well as in the military. The basic phase includes both formal classroom instruction and field practice periods. Subject matter deals with the organization and history of the United States Army, the dynamics of leadership and management, military skills, and mountaineering. ROTC Advanced Course Advanced military science Cadets continue their studies in leadership and tactics with the scope of instruction expanded to include subjects such as military law, battle simulations, group dynamics, organizational management, and decision making. Advanced course contract students receive $420 per month up to a maximum of 20 months (equivalent to two academic years) and an appointment upon graduation as a Second Lieutenant. Contracted students incur a military obligation to the Active Army, the Reserve, or the National Guard. This obligation can consist of as little as three months active duty, with the remainder spent on Reserve, or National Guard status. Students who prefer Reserve or National Guard duty may be guaranteed that they will not be assigned to active duty except for the short period needed to complete a branch basic officer course (three- to six-months depending on the branch selected). Students interested in enrolling as a contract Cadet must contact the Department of Military Science for specific program requirements, guarantees, benefits, and military information. Leader Development and Assessment Course Advanced course (LDAC) cadets are required to attend the four-week Leader Development and Assessment course atFt. Knox, Kentucky, upon completion of the junior year of military science. LDAC attendance is a prerequisite to commissioning but may be delayed until completion of the senior year with the approval of the United States Army and the professor of Military Science at ETSU. Course Sequence Requirements To receive a commission in the United States Army through the military science program, a student must successfully complete 14 credits of courses at the basic level (1200 or 2100 courses), 19 credits at the advanced level (3100 or 4100 courses) and ROTC Advanced Camp (6 credits). Equivalency credit may be given for the basic level courses for those Cadets who are (1) veterans, (2) graduates of junior ROTC programs, or (3) graduates of the ROTC Leaders Training Course. The following sequence will be utilized to obtain a commission as a Second Lieutenant. Four-Year Program Course Sequence MSCI 1217-Physical Fitness (Basic) (1 credit) (repeat for a total of 4 credits) MSCI 1210-Leadership/Personal Development (1 credit) MSCI 1180-Leadership/Personal Development (Lab) (1 credit) MSCI 1220-Introduction to Tactical Leadership (1 credit) MSCI 1181-Tactical Leadership (Lab) (1 credit) MSCI 2110-Innovative Team Leadership (2 credits) MSCI 2150-Military Skills I (2 credits) MSCI 3217-Physical Fitness (Instructor) (1 credit) (repeat for a total of 4 credits) MSCI 3110-Adaptive Tactical Leadership (3 credits) MSCI 3120-Leadership in a Changing Environment (3 credits) MSCI 4110-Developing Adaptive Leaders (3 credits) MSCI 4120-Leadership in a Complex World (3 credits) MSCI 4582-Military History (3 credits) or HIST 3940 - War in the Modern World (3 credits) MSCI 4580-Leadership Development and Assessment (6 credits) Note: The Chair of the Department of Military Science may make exceptions to this policy under unusual circumstances. Military Science Program (Four-Year Program)"
    },
    {
        "document_title": "Additional Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17111&returnto=3362",
        "document_content": " Military Science Program (Two-Year Program)"
    },
    {
        "document_title": "Additional Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17111&returnto=3362",
        "document_content": "Military Science Program Information Department of Military Science POBox 70648 Phone: (423) 439-4269 Web Address: www.etsu.edu/cbat/rotc/ The military science program is a cooperative enterprise between ETSU and the United States Army. The program is designed to develop the students managerial and leadership abilities, introduce students to the mission and organization of the United States Army and prepare advanced-course students for service as commissioned officers in the Active Army, Army Reserve or Army National Guard. Major An academic major in military science is not offered at ETSU. However, completion of the program qualifies the student for a commission as a second lieutenant. Course Credit Students interested in participating in the advanced phase may receive basic phase credit for having prior active or reserve component military service, three years of junior ROTC at the high school level, or for completion of ROTC Leaders Training Course (LTC). ROTC Leaders Training Course (LTC) This is a four-week, paid summer course at Ft. Knox, Kentucky, designed for students who have two academic years remaining and who have not participated in the basic course program or received equivalency credit. LTC attendees receive pay and travel allowances. Training is practical in nature and consists of exercises in which the Cadet is an active participant. There are no military or other obligations for basic camp attendance. Students may earn up to six credits and a two-year Army ROTC scholarship. ROTC Advanced Course Advanced military science Cadets continue their studies in leadership and tactics with the scope of instruction expanded to include subjects such as military law, battle simulations, group dynamics, organizational management, and decision making. Advanced course contract students receive $420 per month up to a maximum of 20 months (equivalent to two academic years) and an appointment upon graduation as a Second Lieutenant. Contracted students incur a military obligation to the Active Army, the Reserve, or the National Guard. This obligation can consist of as little as three months active duty, with the remainder spent on Reserve, or National Guard status. Students who prefer Reserve or National Guard duty may be guaranteed that they will not be assigned to active duty except for the short period needed to complete a branch basic officer course (three- to six-months depending on the branch selected). Students interested in enrolling as a contract Cadet must contact the Department of Military Science for specific program requirements, guarantees, benefits, and military information. Leader Development and Assessment Course Advanced course (LDAC) cadets are required to attend the four-week Leader Development and Assessment course atFt. Knox, Kentucky, upon completion of the junior year of military science. LDAC attendance is a prerequisite to commissioning but may be delayed until completion of the senior year with the approval of the United States Army and the professor of Military Science at ETSU. Course Sequence Requirements To receive a commission in the United States Army through the military science program, a student must successfully complete 6 credits of Leadership Training Course, 19 credits at the advanced level (3100 or 4100 courses) and ROTC Advanced Camp (6 credits). The following sequence will be utilized to obtain a commission as a Second Lieutenant. Two-Year Program Course Sequence MSCI 2580-Leadership Training Course (1-6 credits, variable) MSCI 3217-Physical Fitness (Instructor) (1 credit) (Repeat for 4 credits) MSCI 3110-Adaptive Tactical Leadership (3 credits) MSCI 3120-Leadership in a Changing Environment (3 credits) MSCI 4110-Developing Adaptive Leaders (3 credits) MSCI 4120-Leadership in a Complex World (3 credits) MSCI 4582-Military History (3 credits) or HIST 3940 - War in the Modern World (3 credits) MSCI 4580-Leadership Development and Assessment (6 credits) Note: The Chair of the Department of Military Science may make exceptions to this policy under unusual circumstances. Military Science Program (Two-Year Program)"
    }
]