[
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16839&returnto=3119",
        "document_content": "General Program Information Ron Roach, Ph.D.,Department Chair 222Nicks Hall Box 70556 (423) 439-7494 e-mail: roachr@etsu.edu Jane MacMorran, Ph.D.,Graduate Coordinator Nicks Hall 217 Box 70556 (423) 439-7992 e-mail: macmorra@etsu.edu Faculty: Roy Andrade;Lee Bidgood; Daniel Boner;Rebecca Fletcher;Jane MacMorran;Nate Olson; Ted Olson;Ron Roach;Fred Sauceman;and additional faculty in other academic units who teach Appalachian-related courses. The Department of Appalachian Studies offers an interdisciplinary Graduate Certificate in Appalachian Studies, which features a wide array of courses in the history, culture, and complexity of the Appalachian region, including art, religion, literature, music,community development, health and wellness, energy, education, economics, dialect, and foodways. Articulation Agreements A student who completes the Certificate in Appalachian Studiesand later wishes to pursue the Master of Arts in Appalachian Studies may apply all 18credits into the masters program (with the approval of the APST graduate coordinator). All credit, however, must meet GPA requirements and must be within the six-year matriculation limit. A student who completes the Certificate in Appalachian Studies and later wishes to pursue the Master of Arts in Liberal Studies may apply up to 15credits into the MALS program, with the approval of the MALS director. Admission Requirements The following requirements for theGraduate Certificate in Appalachian Studies are in addition to the general admission requirements of the School of Graduate Studies: A minimum undergraduate GPA of 3.0 on a 4.0 scale. A student whose GPA is lower than 3.0 may request an interview and may be asked to complete an extemporaneous writing sample (in addition to the formal writing sample below). A formal writing sample, such as a paper previously submitted for credit in an undergraduate or graduate course. A student who wishes to pursue an ETSU masters degree concurrently with the certificate must also apply and be admitted to the degree program. Appalachian Studies, Graduate Certificate Requirements: 18 credits Required Courses 3 credits Advisor Approved Electives 15 credits TOTAL 18 credits Required Courses: 3 credits APST 5250-Readings in Appalachian Studies (3 credits) Advisor Approved Electives: 15 credits Students must take at least 9 credits from the following: APST 5150-Seminar in Appalachia and Religion (3 credits) APST 5180-Seminar in Art and Appalachia (3-6 credits) APST 5260-Regional and International Issues in Appalachian Studies (3 credits) APST 5670-Ethnomusicology and Appalachia (3 credits) APST 5690-Appalachian Community Engagement (3 credits) ** BLUE 5410-Individual Instrumental Instruction (1-3 credits) ** BLUE 5510-Graduate Ensemble (1-3 credits) ** BLUE 5900-Independent Study (1-3 credits) ENGL 5060-Literature of Southern Appalachia (3 credits) ENGL 5670-Seminar in Folklore (3 credits) (when topic is Appalachian) *** HIST 5010-Studies in United States History (3 credits) (when topic is Appalachian) Students may take no more than 6 credits from the following dual-enrolled courses: * APST 5237-Scots-Irish in Appalachia (3-6 credits) * APST 5337-Appalachia in Scotland and Ireland (3-6 credits) APST 5907-Foodways of Appalachia (3 credits) APST 5957-Special Topics in Appalachian Studies (1-3 credits) APST 5997-Current Issues in Appalachian Studies (3 credits) BIOL 5247-Appalachian Flora (3 credits) BIOL 5257-Appalachian Fauna (3 credits) ** BLUE 5147-Bluegrass and Americas Music (3 credits) ** BLUE 5257-Band Leadership Skills (4 credits) ** BLUE 5957-Special Topics (1-6 credits) ENGL 5137-Dialectology (3 credits) ENGL 5217-Irish/Scottish Literature (3 credits) Appalachian Studies, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16751&returnto=3119",
        "document_content": "General Program Information Julie Fox-Horton, Ph.D., Graduate Coordinator 108 Rogers Stout Hall Box 70659 (423) 439-4227 e-mail: foxhorton@etsu.edu The Archival Studies Graduate Certificate is an eighteen-credit program designed for individuals who seek formal education in working with archival materials for genealogical purposes, or in settings such as museums, historic sites, libraries, churches, or businesses. The certificate is aligned with Society of American Archivist best practices and is available fully online. Articulation Agreement Students who have completed the Archival Studies Graduate Certificate may have up to 18 of the certificate credits applied toward the Master of Arts in Liberal Studies, Archival Studies Concentration, as long as the courses fall within matriculation limits. Please note that the certificate may be completed online. Program Admission Requirements A student applying to the Certificate in Archival Studies program needs the following: A baccalaureate degree in any field from a regionally accredited institution. An undergraduate cumulative grade point average of 2.5 on a 4.0 scale. Three letters of recommendation. A successful admissions interview. Archival Studies, Graduate Certificate Requirements: 18 credits Required Courses 12 credits Advisor Approved Electives 6 credits TOTAL 18 credits Required Courses: 12 credits AVST 5310-Archives History, Theory, and Current Issues (3 credits) AVST 5311-Archives Principles and Practices (3 credits) AVST 5312-Archives Conservation (3 credits) AVST 5330-Digital Archiving (3 credits) Advisor Approved Electives: 6 credits Students must take two courses from the list below. AVST 5315-Topics in Archival Studies (3 credits) AVST 5320-Principles and Practices of Records Management (3 credits) AVST 5570-Archives Practicum (3 credits) APST 5957-Special Topics in Appalachian Studies (1-3 credits) (when topic is relevant) CSCI 5317-Internet and Computer Law (3 credits) HIST 5950-Introduction to Historical Research (3 credits) HIST 5540-Public History: Theory and Practice (3 credits) HIST 5957-Topics in History (1-6 credits) (when topic is relevant) MEDA 5000-History and Philosophy of Librarianship (3 credits) MEDA 5400-Technology in Teaching and Learning (3 credits) MEDA 5720-Cataloging and Classification (3 credits) PMGT 5140-Public Organization Theory (3 credits) PMGT 5160-Public Budgeting and Finance (3 credits) PMGT 5300-Not-for-Profit Resource Development (3 credits) Archival Studies, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16850&returnto=3119",
        "document_content": "General Program Information Natalie L. Smith, Ph.D., AssociateProfessor, Esports Graduate Program Coordinator Box 70671 E226 Ballad Health Athletic Center (423) 439-4382 e-mail: smithnl4@etsu.edu Kason ONeil, Ph.D. Professor, Department Chair E218 Ballad Health Athletic Center (Mini Dome) 423-439-4632 e-mail: oneilkm@etsu.edu Faculty :Amy Greene; Natalie Smith. The graduate certificate in Athletic Administration aims to fulfill a marketplace need for high quality athletic administrators in interscholastic and intercollegiate realms. It intends to achieve this goal by providing students with knowledge and practical experiences in legal issues, administration of athletics, sport marketing, financing of sports, facilities management, and issues in sport management. Better administrators will better serve the schools and universities constituencies by improving the student-athletes experience, reducing potential liabilities, and increasing financial responsibility. The certificate will provide sport management aspiring professionals, middle and high school, junior college teachers, and athletic directors (within all knowledge areas)the opportunity to enhance their chances of obtaining an Athletic Administration position. Articulation Agreement Once the Certificate coursework is completed, students with a B or better grade in all classes may choose to continue their studies and apply for admission into the M.S. in Sport Management. For these applicants, all 18 credits for the certificate may apply toward the M.S. degree. These applicants will not be required to submit GRE scores for admission into the M.S. program. Admissions Requirements In addition to the School of Graduate Studies admissions requirements, prospective students in the Athletic Administration certificate program must provide three letters of recommendation. Advising will be conducted online or in-person by theGraduate Coordinator. Athletic Administration, Graduate Certificate Requirements: 18 credits Required Courses 18 credits TOTAL 18 credits Required Courses: 18 credits SALM 5430-Administration of Sport, Esports, & Recreation (3 credits) or SALM 5215-Sport in Society (3 credits) SALM 5220-Issues in Sport Management (3 credits) SALM 5225-Facilities & Event Management in Sport & Recreation (3 credits) SALM 5230-Legal Issues in Physical Education and Sport (3 credits) SALM 5243-Sport, Esport, and Recreation Marketing (3 credits) SALM 5245-The Financing of Sport (3 credits) Athletic Administration, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16759&returnto=3119",
        "document_content": "General Program Information David Shoham, Ph.D., M.S.P.H.,Chair, GraduateCoordinator College of Public Health Department of Biostatistics and Epidemiology Lamb Hall 351 Email: shoham@etsu.edu Phone: (423) 439-4477 The Graduate Biostatistics Certificateis a 13-credits 100% online program housed in the ETSU College of Public Health, Biostatistics and Epidemiology Department. This program provides access to a selection of master level courses in biostatistics for students wanting to earn a robust, applied skill set in a short timeframe. Our students are online learners seeking to explore biostatistics career potential or further their professional effectiveness. Many of our certificate graduates continue their studies by enrolling in our MPH programs. Admission to the Program In addition to the admissions criteria set by the ETSU Graduate School, the followingis required: a resume or curriculum vitae, a statement of interest, and a virtual interview. Factors considered in the admission decision include the applicants educational goalsand demonstrated ability to succeed in the program. Program of Study The program of study consists of four (4) courses. Two (2) are required courses and the other two (2) are elective courses students will select from a list of Advisor Approved Electives. Articulation Agreement Students who have completed the Biostatistics Graduate Certificate and subsequently are admitted into the MPH in Biostatistics may have up to thirteen(13) of the certificate credits applied toward the degree program of study. Biostatistics, Graduate Certificate Requirements: 13 credits Core Courses 7 credits Advisor Approved Electives 6 credits TOTAL 13 credits Required Courses: 7 credits BSTA 5350-Intermediate Biostatistics (3 credits) EPID 5100-Analytic Methods in Public Health (4 credits) Advisor Approved Electives: 6 credits Select 6 credits from the list below. BSTA 5360-Clinical Research: Design and Analysis (3 credits) BSTA 5370-Categorical Data Analysis (3 credits) BSTA 5385-Applied Longitudinal Data Analysis (3 credits) BSTA 5390-Survival Analysis in Public Health (3 credits) BSTA 6170-SAS Programming with Research Applications in Public Health (3 credits) CSCI 5000-Data Management (3 credits) CSCI 5010-Programming for Data Analytics (3 credits) STAT 5217-Statistical Machine Learning (3 credits) STAT 5730-Applied Multivariate Statistical Analysis (3 credits) Biostatistics, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16933&returnto=3119",
        "document_content": "General Program Information Donna Cherry, Ph.D.,Graduate Coordinator Box 70645 (423) 439-6018 email: cherryd@etsu.edu Department of Social Work POBox 70645 Phone: (423) 439-6013 Web address: https://www.etsu.edu/crhs/socialwork/ The Child Advocacy Studies TrainingGraduate Certificate provides students with additional knowledge and skills to address child maltreatment from an interprofessional perspective.The certificate is designed to compliment a bachelor or masters degree in fields that need knowledge of child maltreatment and advocacy strategies such as social work, nursing, criminal justice, education, and other fields that work with children and families. Students will gain knowledge of working in an interprofessional environment to better meet the needs of survivors of child abuse and their families.The CAST Graduate Certificate is nationally recognized by Zero Abuse Project Child Advocacy Studies. Program Admission Requirements Students must meet the Graduate School admission requirements. Child Advocacy Studies Training, Graduate Certificate Requirements: 9 credits Required Courses 9 credits Total 9 credits Required Courses: 9 credits SOWK 5321-Professional and System Response to Child Abuse (3 credits) SOWK 5322-Responding to the Survivor of Child Abuse and Survivor Responses (3 credits) SOWK 5327-Perspectives on Child Maltreatment and Advocacy (3 credits) Child Advocacy Studies Training, Graduate Certificate (Online)"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16884&returnto=3119",
        "document_content": "General Program Information Donna Cherry, Ph.D.,Graduate Coordinator Box 70645 (423) 439-6018 email: cherryd@etsu.edu The Clinical Addiction CounselingStudies Certificateis a 12 credit program of study designed to provide the learner with specific knowledge and skills to help mitigate the consequences and risks associated with substance use disorders and addiction. The certificate is designed for learners interested in pursuing state licensure or certification as clinical addiction specialists or alcohol and drug abuse counselors. Because the Appalachian region has been significantly affected by substance misuse and addiction, the focus of the program is to prepare students to become clinical practitioners, advocates, and leaders in respect to the prevention and treatment of substance use disorders and addiction in the Appalachian region. Improving the quality of life for all individuals, families, and communities in our region is the overarching goal for the certificate program. Course Requirements TheClinical Addiction Counseling Studies Certificate will be awarded only to students who have been officially admitted to the program and successfully completed the 12 creditsof approvedcoursework. The time limit for use of credit toward the certificate is six (6) years from the date of enrollment in the earliest course applied toward the certificate. In order to receive the certificate, a student must earn a cumulative grade point average of 3.0 or above on coursework. For more information and application materials, write or call: East Tennessee State University Clinical Addiction Counseling Studies Certificate Dr. Jesse Gilreath, Graduate Coordinator Department of Social Work Lyle House 200 Box 70645 (423) 439-6013 email: gilreathj@etsu.edu Admission to the Program In addition to the admissions criteria set by the ETSU School of Graduate Studies, the following will be required: The criteria for admission to theClinical Addiction Counseling Studies Certificate program include the following minimum requirements. Certificate program include the following minimum requirements. A bachelors degree in a behavioral health discipline (social work, psychology, counseling, or human services) from a regionally accredited institution. Or, the applicant is a current graduate student in a behavioral health discipline. A minimum undergraduate grade point average of 2.5 on a 4.0 scale. Completed application materials. Application materials which must be submitted to the School of Graduate Studies include: an application; essay describing reason for pursuing the certificate (< 500 words); three (3) letters of recommendation; transcripts from all colleges attended; and arésumé or CV. All applications will be evaluated by an admission committee. First preference for admission will be given to candidates who seek dual admission to both the MSW program and the Certificate program and those who are current ETSU graduate students. Timely submission of application materials is encouraged as space is limited. Articulation Agreement A student may simultaneously pursue both thecertificateand an ETSU graduate degree if duly admitted to both programs. Admission to a degree program and successfully completing coursework typically required for the graduatecertificatedoes not automatically qualify a student for thecertificate. Clinical Addiction Counseling Studies, Graduate Certificate Requirements: 12 credits Required Courses 12 credits TOTAL 12 credits Required Courses: 12 credits Each student, with the assistance of the Certificate Coordinator, will design a program of study to include 12 credits as indicated below. Current ETSU graduate students must also work with their graduate program advisors to ensure their respective program requirements are met. SOWK 5300-Seminar in Substance Use and Addiction (3 credits) SOWK 5368-Clinical Practice in Addiction Treatment and Prevention (3 credits) SOWK 5369-The Science of Addiction for Behavioral Health Professionals (3 credits) SOWK 5370-Cultural Humility in Addiction Treatment and Prevention (3 credits) Clinical Addiction Counseling Studies, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16865&returnto=3119",
        "document_content": "General Program Information Dr. Jill Channing, Graduate Coordinator 514Warf Pickle Hall (423) 439-7545 Email: channing@etsu.edu The Community College Leadership Graduate Certificate Program is a 15-credit program of study designed to provide the learner with specific leadership and management tools for the community college environment. The focus of the program is to further educate community college faculty and staff who seek positions of leadership or increased responsibility for those already in positions of leadership. Articulation Agreement The 15 credits that are required for the certificate can be applied to the Ed.D. in Higher Education Leadership (HEDL) concentration. A participant who wishes to pursue an ETSU Ed.D. degree in Educational Leadership with an HEDL concentration concurrently with the certificate must also apply and be admitted to the degree program. Admission Requirements To be considered for acceptance into this certificate program you must: Possess at least a masters degree from a regionally accredited institution; Be currently employed at a community college; Have at least a 3.0 on a 4.0 scale in the most current awarded degree; Meet the general admission requirements of the ETSU School of Graduate Studies. Be nominated by a community college president or his/her designee. In addition to the requirements ofthe School of Graduate Studies applicants must also submit the following: A one-page letter (essay) stating interest in the Community College Leadership graduate certificate program; A vita or resume with a list of four professional references including contact information All applications will be evaluated by an admission committee composed of faculty members of the Department of Educational Leadership and Policy Analysis. Applicants will be evaluated on (1) GPA in most recent degree; (2) professional work experience; (3) prior positions of leadership; (4) writing ability; and (5) demonstrated interest in community college leadership. Applicants are encouraged to address their related accomplishments, goals, and interest in community college leadership in the essay and in their vita. Community College Leadership, Graduate Certificate Requirements: 15 credits Required Courses 15 credits TOTAL 15 credits Required Courses: 15 credits ELPA 6020-Seminar in Educational Supervision (3 credits) ELPA 6454-Policy, Power, and Politics in Education (3 credits) ELPA 6561-Organization Development (3 credits) ELPA 6870-Field Research in Educational Leadership (3 credits) ELPA 7110-Community Colleges in the United States (3 credits) Community College Leadership, Graduate Certificate* (Online)"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16860&returnto=3119",
        "document_content": "General Program Information Jill LeRoy-Frazier, Ph.D. Graduate Coordinator Yoakley Hall, Second Floor (423) 439-4223 leroyfra@etsu.edu Faculty: Deborah Harley-McClaskey The Certificate in Community Leadership is designed for those with bachelors degrees who desire advanced leadership credentials to prepare for professional careers leading teams and organizations. Admission Requirements The criteria for admission to the Community Leadership Certificate Program include: A bachelors degree from a regionally accredited institution. A minimum undergraduate grade point average of 2.5 on a 4.0 scale, for domestic students; and a 3.0 on a 4.0 scale for international students. Application materials which must be submitted to the School of Graduate Studies include: An application; Transcripts from all colleges attended. Community Leadership, Graduate Certificate Requirements: 12 credits Required Courses 12 credits TOTAL 12 credits Required Courses: 12 credits LEAD 5501-Strategies for Personal Productivity and Interpersonal Effectiveness (3 credits) LEAD 5601-Foundations of 21st Century Community Leadership (3 credits) LEAD 5701-Financial Leadership and Resource Development in Community Organizations (3 credits) LEAD 5801-Capstone in Community Leadership: Empowerment, Collaboration, and Change (3 credits) Community Leadership, Graduate Certificate* (Online)"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16900&returnto=3119",
        "document_content": "General Program Information Jeff Roach, Ph.D., Graduate Coordinator 473Nicks Hall (423) 439-6966 e-mail: roachj@etsu.edu Brian T. Bennett, Ph.D., Department Chair 4-464 Nicks Hall Box 70711 (423) 439-5328 e-mail: bennetbt@etsu.edu Faculty:Brian Bennett; Mathew Desjardins; Edward Hall; Matthew Harrison; Stephen Hendrix; Ghaith Husari; Mohammad Khan;Phillip Pfeiffer; Tony Pittarese; Jack Ramsey; Tahsin Rezwana; Jeffrey Roach; David Tarnoff In addition to its ABET-accredited undergraduate programs in computer science, information systems, and information technology, the department offers a Master of Science (M.S.) degree program in computer and information sciences with two concentrations: applied computer science and information technology.The Department also offers a four-course graduate certificate in data analytics. Note: The departments course offerings and requirements (as well as university regulations) are continually under examination and revision. Requirements, policies, and course offerings are subject to change at any time. Articulation Agreements Students enrolled in the Graduate Certificate in Data Analytics may apply all 12 credits into the M.S. in Information Systems with the approval of the M.S. in Information Systems Program Coordinator.All credits must meet GPA requirements andmatriculation limits. Students who completed the Graduate Certificate in Data Analytics may apply9 credits into the Master of Business Administration with the approval of the Director of the Master of Business Administration Program. All applied credits must meet GPA requirements and the Graduate School matriculation limits. Data Analytics, Graduate Certificate Requirements: 12 credits Required Courses 12 credits TOTAL 12 credits Required Courses: 12 credits CSCI 5000-Data Management (3 credits) CSCI 5010-Programming for Data Analytics (3 credits) CSCI 5050-Decision Support Systems (3 credits) CSCI 5047-Data Analytics and Visualization (3 credits) Data Analytics, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16835&returnto=3119",
        "document_content": "General Program Information Jane Tingle Broderick, EdD, Early Childhood Emergent Inquiry Certificate Coordinator,Co-Coordinator, Doctoral Program 214 Warf-Pickel Hall PO Box 70548 423-439-7695 email: emergentinquiry@etsu.edu ; broderic@etsu.edu Pamela Evanshen, EdD,Department of Early Childhood Education Chair, Co-Coordinator, Doctoral Program 209 Warf-Pickel Hall PO Box 70548 423-439-7694 email: evanshep@etsu.edu The Early Childhood Education Program offers an Early Childhood Education Emergent Inquiry Certificate Program. The goals and objectives for this online certificate are focused on emergent inquiry curriculum in the field of early childhood education. They align with the vision of our professional organization, the National Association for the Education of Young Children (NAEYC), for educating early childhood teachers and teacher leaders. Candidates in this certificate program will demonstrate the knowledge and skills of the NAEYC Core Standards for Professional Preparation (See NAEYC standards on their website: www.naeyc.org/academy/primary/standardsintro ). Articulation Agreement A student who applies and is accepted into the masters program in Early Childhood Education with a concentration in Master Teacher or Research concentration, may apply up to eighteen credit hours from the Early Childhood Education Emergent Inquiry Certificate Program. Individuals who have graduated with a masters degree in Early Childhood Education from ETSU and have successfully completed ECED 5336 - Advanced Creative Development with a grade of B or above, will have a program of study of 15 graduate credit hours for the Early Childhood Education Emergent Inquiry Certificate. Admission Requirements In addition to the requirements of the School of Graduate Studies: A bachelor or masters degree in Early Childhood or a related field (Psychology, Special Education, Elementary Education, etc.) Two years of experience working with young children (birth through 8 years) are preferred; Two letters of recommendation Early Childhood Education Emergent Inquiry, Graduate Certificate Requirements: 18 credits Required Courses 18 credits TOTAL 18 credits Required Courses: 18 credits ECED 5600-Social Development from a Constructivist Perspective (3 credits) ECED 5610-Family Community Relations from an Emergent Inquiry Perspective (3 credits) ECED 5620-History and Philosophy from an Emergent Inquiry Perspective (3 credits) ECED 5336-Advanced Creative Development (3 credits) ECED 5640-Designing Physical Environments from an Emergent Inquiry Perspective (3 credits) ECED 5650-Language and Literacy from an Emergent Inquiry Perspective (3 credits) Early Childhood Education Emergent Inquiry, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16931&returnto=3119",
        "document_content": "General Program Information Cynthia Chambers, Ph.D., Associate Dean of Educator Preparation 322 Warf Pickel 423-439-7586 chamberc@etsu.edu Clemmer College of Education and Human Developmentoffers a Certificate in Job-Embedded that provides coursework directed at clinical practice in the field. This certificate program allows candidates who have completed all initial licensure program coursework, with the exception of Residency II and Seminar, and Praxis content examinations for the licensure area to fulfill the remaining licensure requirements including a clinical practice andseminar. Upon completion of the requirements of the graduate certificate in Educator Job Embedded, the candidate will be recommended for full completion of teacher licensure requirements for the specified endorsement with the Tennessee Department of Education. Program Admission Requirements In addition to Graduate Studies requirements, admission to the Educator Job EmbeddedGraduate Certificate includes the following requirements: Completion of all initial licensure course requirements with the exception of Residency II A minimum overall GPA of 2.75 from a completed baccalaureate degree program in the area in which licensure is being sought Passing Praxis Content Examination scores for the licensure area which have been officially received by ETSU and are required in accordance with state policy,or a bachelors degree in the licensure area from ETSU. Intent to hire agreement from an area school district Articulation Agreement A student who completes the Graduate Certificate in Job Embedded and later wishes to pursue the Masters programs in Curriculum and Instruction or Advanced Studies in Special Education may transfer the certificate credits into the masters degree with approval of the degree graduate coordinator and the School of Graduate Studies. All transfer credit, however, must meet GPA requirements and must be within the six-year matriculation limits. Educator Job Embedded Graduate Certificate Requirements: 12 credits Required Courses 12 credits Total 12 credits Required Courses: 12 credits SPED 5830-Job-embedded Clinical Practice (1-9 credits) (take for a total of 9 credits) and SPED 5851-Residency II Seminar in Special Education (3 credits) or CUAI 5590-Supervised Field Mentoring (1-10 credits) (take for a total of 10 credits) and CUAI 5591-MAT Seminar (2 credits) Educator Job Embedded, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16910&returnto=3119",
        "document_content": "Program Information Department of Curriculum and Instruction ETSU Box 70684 Johnson City, TN 37614 (423) 439-7595 Web Address: www.etsu.edu/coe/cuai Natalia Ward, Ph.D., Program Coordinator 409D Warf-Pickel Hall Box 70684 (423) 439-7052 email: wardna1@etsu.edu Karin Keith, Ph.D., Chair 401Warf-Pickel Hall Box 70684 (423) 439-7598 email: keithkj@etsu.edu The Department of Curriculum and Instructionoffers a Certificate in English as a Second Language PreK-12 licensure program. The program provides advanced coursework directed at instructional practices for individuals who want to teach English learners (ELs) in PreK-12 settings. For current teachers, this certificate program can lead to an additional teacher licensure in PreK-12 English as a Second Language . English as a Second Language (ESL) PreK-12, Graduate Certificate Requirements: 12 credits Required Courses 12 credits TOTAL 12 credits Required Courses: 12 credits CUAI 5007-Assessment of English Learners in PreK-12 Classrooms (3 credits) CUAI 5010-Advanced Studies of Language and Culture in PreK-12 Classrooms (3 credits) CUAI 5017-ESL Teaching Methods and Materials in PreK-12 Classrooms (3 credits) CUAI 5604-Advanced Internship in PreK-12 ESL Classrooms (3 credits) Note: Students who have taken undergraduate equivalencies of the above courses may substitute such courses with coursework approved by the Graduate Coordinator and the students advisor of record. English as a Second Language PreK-12, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16780&returnto=3119",
        "document_content": "General Program Information David Shoham, Ph.D., M.S.P.H.,Chair, GraduateCoordinator College of Public Health Department of Biostatistics and Epidemiology shoham@etsu.edu (423) 439-4477 The Graduate Epidemiology Certificate is a 13-credits 100% online program housed in the ETSU College of Public Health, Biostatistics and Epidemiology Department. This program provides access to a selection of master level courses in epidemiology for students wanting to earn a robust, applied skill set in a short time frame. Our students are online learners seeking to explore epidemiologys career potential or further their professional effectiveness. Many of our certificate graduates continue their studies by enrolling in our MPH programs. Admission to the Program In addition to the admissions criteria set by the ETSU Graduate School, the following isrequired: a resume or curriculum vitae, a statement of interest, and a virtual interview. Factors considered in the admission decision include the applicants educational goals and demonstrated ability to succeed in the program. Program of Study The program of study consists of four (4) courses. Two (2) are required courses and the other two (2) are elective courses students will select from a list of Advisor Approved Electives. Articulation Agreement Students who have completed the Graduate Certificate in Epidemiology and subsequently are admitted into the MPH degree program with a concentration in epidemiology may have up to thirteen (13) of the certificate credits applied toward the degree program of study as long as the courses fall within the matriculation limits. Epidemiology, Graduate Certificate Requirements: 13 credits Required Courses 7 credits Advisor Approved Electives 6 credits TOTAL 13 credits Required Courses: 7 credits EPID 5100-Analytic Methods in Public Health (4 credits) EPID 5405-Intermediate Epidemiology (3 credits) Advisor Approved Electives: 6 credits Choose 6 credits from the list below. EPID 5420-Epidemiology of Chronic Disease (3 credits) EPID 5430-Epidemiology of Infectious Disease (3 credits) EPID 5460-Environmental Epidemiology (3 credits) EPID 5907-Independent Study in Public Health - Epidemiology (1-3 credits) (take for 3 credits) BSTA 6170-SAS Programming with Research Applications in Public Health (3 credits) Epidemiology, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16899&returnto=3119",
        "document_content": "General Program Information Natalie L. Smith, Ph.D., Assistant Professor, Esports Graduate Program Coordinator Box 70671 E226 Ballad Health Athletic Center (423) 439-4382 e-mail: smithnl4@etsu.edu Michael Ramsey, Ph.D. Professor, Department Chair Box 70671 (423) 439-4375 e-mail: ramseym@etsu.edu Faculty :Amy Greene; Natalie Smith;Charles Jones. The graduate certificate in Esports Management aims to fulfill a marketplace need for high quality esports managers in the emerging and growing esports industry. It intends to achieve this goal by providing students with knowledge and practical experiences in esports governance and management and performance management, as well as opportunities to choose opportunities to learn in marketing, communications, facility and event management, and administration of esports. Better administrators will better serve the emerging esports industry by improving experience for esports athletics, fan experience and identification, reducing potential liabilities and improving the the esports commercial offerings. The certificate will provide esports management aspiring professionals, esports athletes and coaches, and any athletic administrators interested in expanding into esports, the opportunity to enhance their chances of obtaining an esports management position or being offering esports programming in their current organizations. Admissions Requirements In addition to the admission requirements established by the School of Graduate Studies, the program requires that the personal essay details interest in the esports management graduate certificate, and two letters of recommendation are submitted. Articulation Agreement A student who completes the Graduate Certificate in Esports Management and later wishes to pursue the Sport Management Master of Science may apply the certificate credits into the masters degree with approval of the degree graduate coordinator and the School of Graduate Studies. Allcredit, however, must meet GPA requirements and must be within the six-year matriculation limits. Esports Management, Graduate Certificate Requirements: 12 credits Required Courses 6 credits Advisor Approved Electives 6 credits TOTAL 12 credits Required Courses: 6 credits SALM 5234-Esports Governance and Management (3 credits) SALM 5238-Esports Performance Management (3 credits) Advisor Approved Electives: 6 credits Choose 2 courses from the following: SALM 5225-Facilities & Event Management in Sport & Recreation (3 credits) SALM 5232-Sport Communication and Media Relations (3 credits) SALM 5243-Sport, Esport, and Recreation Marketing (3 credits) SALM 5430-Administration of Sport, Esports, & Recreation (3 credits) Esports Management, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16878&returnto=3119",
        "document_content": "General Program Information Jake VanHuss, Graduate Coordinator 116 Warf-Pickel (423) 439-4167 vanhussj@etsu.edu Admission Requirements In addition to the admission requirements of the School of Graduate Studies, the following materials are required for admission to the Graduate Certificate in Film Production: Submit an application to the School of Graduate Studies by July 1, along with an essay of 500 words describing the applicants reason for pursuing the certificate program, including background experience in film, video, or television production. The essay should include information on what kinds of film and media the applicant is interested in during study at ETSU and after completion of the certificate. Starting Semester Deadline Domestic Applicants Deadline International Applicants Fall August 10 May 1 Summer May 15 February 1 Spring December 5 October 1 Articulation Agreement Students enrolled in the Brand and Media Strategy M. A. may enroll in and apply up to 12 hours of the following coursework- MCOM 5080 , RTVF 5100 , RTVF 5200 , and RTVF 5300 -to the Graduate Certificate Program in Film Production. Likewise, students enrolled in the Graduate Certificate in Film Production may enroll in and apply up to 12 hours of the certificate to the Brand and Media Strategy M. A. Film Production, Graduate Certificate Requirements: 12 credits Required Courses 9 credits Advisor Approved Elective 3 credits TOTAL 12 credits Required Courses: 9 credits RTVF 5100-Documentary Research and Production (3 credits) RTVF 5200-Directing Film (3 credits) RTVF 5300-Narrative Film (3 credits) Advisor Approved Electives: 3 credits Choose 3 credits from the following: MCOM 5080-Media Law & Ethics (3 credits) or Advisor Approved Elective (3 credits) Film Production, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16781&returnto=3119",
        "document_content": "General Program Information Larry S. Miller, Ph.D., Department Chair,Graduate Coordinator 201 Rogers-Stout Hall Box 70555 (423) 439-5964 e-mail: millerls@etsu.edu Faculty: Heidi Harralson; Larry Miller. The Department of Criminal Justice and Criminology offers a graduate certificate in Forensic Document Examination. Students completing this certificate will have gained knowledge in handwriting identification, print process identification, and the court system in the United States allowing them to seek employment and become certified as forensic document examiners. Program Admission Requirements See the Admissions page for admission guidelines. Forensic Document Examination, Graduate Certificate Requirements: 12 credits Required Courses 12 credits TOTAL 12 credits Required Courses: 12 credits CJCR 5110-Forensic Document Examination (3 credits) CJCR 5120-Forensic Handwriting Identification (3 credits) CJCR 5130-Forensic Document Analysis (3 credits) CJCR 5140-Forensic Document Practicum (3 credits) Forensic Document Examination, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16877&returnto=3119",
        "document_content": "General Program Information Eileen Ernenwein, Graduate Coordinator 315Ross Hall (423) 439-7513 e-mail: ernenwei@etsu.edu The Geographic Information Systems Graduate Certificate can be completed online, in person, or through a combination of both learning styles. Admissions The admissions criteria set by the ETSU School of Graduate Studies will be followed. Articulation Agreement A student who completes the Graduate Certificate in GIS and later wishes to pursue the M.S. inGeosciences may apply all 12 credits into the masters program with approval of the M.S. Geosciences graduate coordinator and the School of Graduate Studies. All credit, however, must meet GPA requirements and must be within the six-year matriculation limit. Geographic Information Systems, Graduate Certificate Requirements: 12 credits Required Courses 6 credits Advisor Approved Electives 6 credits TOTAL 12 credits Required Courses: 6 credits GEOS 5010-Geospatial Analysis (3 credits) GEOS 5317-Advanced Geographic Information Systems (3 credits) Advisor Approved Electives: 6 credits Choose 6 credits from the following: GEOS 5017-Advanced Cartography: Web & Mobile Mapping (3 credits) GEOS 5300-Topics in Geospatial Analysis (3 credits) GEOS 5320-Geographic Information Systems Projects (3 credits) GEOS 5350-Statistics for Geosciences (3 credits) GEOS 5900-Independent Study (1-3 credits) Other relevant courses at ETSU with advisor approval Geographic Information Systems, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16783&returnto=3119",
        "document_content": "General Program Information Jodi Southerland DrPH MPH, Graduate Coordinator Community and Behavioral Health College of Public Health PO Box 70674 Office Location: 451 Lamb Hall Office: (423) 439-4309 Fax: (423) 439-6570 email: southerlanjl@etsu.edu The Gerontology Graduate Certificate Program is an interdisciplinary 16-creditprogram of study designed to provide the learner with specific leadership and management tools for the health care environment. The focus of the program is to educate students who will be leaders in improving the quality of life for older individuals and their families in Tennessee, the nation, and the world. Admission to the Program The criteria for admission to the Gerontology Graduate CertificateProgram include: A bachelors degree from a regionally accredited institution. A minimum undergraduate grade point average of 2.5 on a 4.0 scale. Application materials which must be submitted to the School of Graduate Studies include: an application; a résumé demonstrating interest and/or experience in gerontology; three (3) letters of recommendation; and transcripts from all colleges attended. All applications will be evaluated by an admission committee composed of representatives from the Gerontology Steering Committee. Course Requirements The Gerontology Graduate Certificate will only be awarded to students who have been officially admitted to the program and successfully completed the sixteen (16) credits of approvedcoursework. A student may transfer up to nine (9) credits of approved coursework into the program. In the final semester, a student must complete a culminating experience as part of the Advanced Interdisciplinary Seminar in Gerontology. The time limit for use of credit toward the certificate is six (6) years from the date of enrollment in the earliest course applied toward the certificate, including transferred courses. In order to receive the certificate, a student must earn a cumulative grade point average of 3.0 or above on coursework. A student may simultaneously pursue both the certificate and a graduate degree program if duly admitted to both programs. However, being admitted to a degree program and successfully completing coursework typically required for the graduate certificate does not automatically qualify a student for the certificate. For more information and application materials, write or call: East Tennessee State University College of Public Health Gerontology Graduate Certificate Program P.O. Box 70624 Johnson City, TN 37614 Phone: (423) 439-4332 or East Tennessee State University School of Graduate Studies P.O. Box 70720 Johnson City, TN 37614 Phone: (423) 439-4221 Program of Study Each student, with the assistance of an assigned advisor, will design a program of study to include ten (10) credits of core requirements and a minimum of six (6) credits of guided electives to be selected from listed courses. Note: Some clinical/discipline specific courses will have prerequisites that must be met. Gerontology, Graduate Certificate Requirements: 16 credits Required Courses 10 credits Advisor Approved Electives 6 credits TOTAL 16 credits Required Courses: 10 credits HSMP 5535-Health Policy, Politics, and Analysis (3 credits) COBH 5607-Gerontology and Health (3 credits) COBH 5500-Advanced Seminar in Gerontology: An Interdisciplinary Approach (4 credits) Advisor Approved Electives: 6 credits Choose 6 credits from the following: NRSE 5013-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner II (3 credits) NRSE 5021-Life Span Assessment and Clinical Management: Womens Health (2-3 credits) AUDI 6310-Rehabilitative Audiology for Adults (3 credits) PEXS 5977-Exercise Management (3 credits) COBH 5110-Community Health Assessment Research (3 credits) Other electives as approved by the graduate faculty advisor (3 credits) Gerontology, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16887&returnto=3119",
        "document_content": "General Program Information Megan Quinn, Dr.P.H., MSc.,Graduate Coordinator Lamb Hall 343 email: quinnm@etsu.edu (423) 439-4427 The Global HealthCertificateis a 17-creditprogram of study designed to provide the learner with specific knowledge and skills in global health from an interprofessional perspective. The certificate is designed for learners interested in global health. The certificate includescurricular and practice based opportunities, both here and abroad. The Global Health Certificate is open tograduate and professional students interested in global health and is available on campus and fully online. Students in the Global Health Certificate are required to complete an international field experience.Costs for this will vary based on location.Students are expected to fund this experience personally or through scholarship funds.Scholarships are available through the Study Abroad Scholarship program and information can be found here . Admission to Program Students can be admitted to the program in fall or spring semesters. The criteria for admission to the Graduate Certificate in Global Health program includes the following requirements in addition to the admissions requirements for the School of Graduate Studies: arésumé or CV. All applications will be evaluated by an admission committee. Current ETSU graduate students are exempt fromtranscript submission requirements. ProgramRequirements The Global Health Certificate will be awarded only to students who have been officially admitted to the program and successfully completed the 17 credits of approvedcoursework. The time limit for use of credit toward the certificate is six years from the date of enrollment in the earliest course applied toward the certificate. In order to receive the certificate, a student must earn a cumulative grade point average of 3.0 or above on coursework. A student may simultaneously pursue both the certificate and an ETSU graduate degree if duly admitted to both programs. Students must complete a dual degree form and a program of study for each program.Admission to a degree program and successfully completing coursework typically required for the graduate certificate does not automatically qualify a student for admission to the certificate program. Articulation Agreement A student whocompletesthe Graduate Certificate in Global Healthand later wishes to pursue theMaster of Public Healthmay apply up to nine credits of the certificate credits intothe masters degree with approval of the degree graduate coordinator and the School of Graduate Studies.All credit, however, must meet the GPA requirements and must be within the six-year matriculation limits. Global Health, Graduate Certificate Requirements: 17 credits Each student, with the assistance of the Certificate Coordinator, will design a program of study to include 17 credits as indicated below. Current ETSU graduate students must also work with their graduate/professionalprogram advisors to ensure their respective program requirements are met. Required Courses 8 credits Advisor Approved Electives 6 credits International Field Placement 3 credits TOTAL 17 credits Required Courses: 8 credits PMPR 7131-Global Healthcare: Disease Treatment and Prevention (3 credits) COBH 5707-International Health: An Overview of Problems and Issues (3 credits) COBH 5040-Seminar in Global Health (1 credit) COBH 5050-Low-resource Training in Global Health (1 credit) Advisor Approved Electives: 6 credits Students will work with the coordinator for the global health certificate to choose six credits of elective courses. These courses can be discipline specific and can be online or onsite. If a student chooses to complete EPID 5700 , Interprofessional Perspectives on Global Health, as one of their electives it cannot count as their international field placement. Choose 2 courses for a total of 6 credits from the following: COBH 5270-Cultural Competence and Spirituality (3 credits) COBH 5457-Emerging Technologies for the Health Professions (3 credits) COBH 5607-Gerontology and Health (3 credits) COBH 5900-Grant and Proposal Development (3 credits) EPID 5430-Epidemiology of Infectious Disease (3 credits) EPID 5700-Interprofessional Perspectives on Global Health (3 credits) HSMP 5200-Health Leadership & Management (4 credits) HSMP 5400-Data Informed Decision-Making in Health Administration (3 credits) HSRV 5200-Ethics and Social Justice (3 credits) PMPR 7126-Global Healthcare: Perspectives and Practice (3 credits) SOWK 5957-Special Topics in Social Work (3 credits) International Field Placement: 3 credits Students will complete an international field placement in a low resource setting. Students must spend a minimum of two weeks in country and the location and project must be approved by the certificate coordinator and the Global Health Certificate Advisory Committee. This can be completed through a study abroad course or a field placement course. Choose 1 course from the following: COBH 5850-Public Health Program Field Experience - Community and Behavioral Health (1-6 credits) EPID 5700-Interprofessional Perspectives on Global Health (3 credits) EPID 5850-Public Health Program Field Experience - Epidemiology (1-6 credits) Global Health, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16889&returnto=3119",
        "document_content": "General Program Information Dr. Lisa Haddad, PhD, RN, Associate Dean of Graduate Programs 207 Roy Nicks Hall Box 70629 (423) 439-5626 email: HaddadL@etsu.edu Dr. Alex Sargsyan, Graduate Coordinator Nicks Hall, 2-248 (423) 439-4517 email: sargsyan@etsu.edu The Health Care Genetics and Genomics post-baccalaureate certificate program is offered to nurses and other healthcare professionals. This certificate program provides knowledge of how the genetic makeup and the environment may contribute to the development of common inherited disorders. This certificate program will prepare the students to utilize knowledge of genetics, genomics, epigenetics, pharmacogenetics, genetic testing, and genetic counseling in their practice. Admission Policy Potential applicants must have a baccalaureate degree in nursing or in a health related field from a regionally accredited institution. All potential applicants must meet ETSU School of Graduate Studies admission requirements. Health Care Genetics and Genomics, Graduate Certificate Requirements: 12 credits Required Courses 12 credits TOTAL 12 credits Required Courses: 12 credits NRSE 5320-Human Genetics and Genomics Essentials (3 credits) NRSE 5322-Pharmacogenetics and Pharmacogenomics (3 credits) NRSE 5324-Advanced Human Genetics and Genomics (3 credits) NRSE 5326-Seminar and Practicum in Human Genetics and Genomics (3 credits) Health Care Genetics and Genomics, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16784&returnto=3119",
        "document_content": "General Program Information Jennifer Hunt,MPH, CMRP (AHA-CC), RHA/ACLFA, Program Coordinator College of Public Health Lamb Hall 257 Box 70264 (423) 439-6135 email: publichealth@etsu.edu The Health Care Management Graduate Certificate Program is an interdisciplinary 13-creditprogram of study designed to provide the learner with leadership and strategic management tools specifically for the health care environment. The focus of the program is to assist students to envision a broadened career perspective on the changing scope of health care delivery and management. Faculty from the Colleges of Business and Technology, Nursing, and Public Health design and teach the courses within the program. Admission to the Program In addition to the admissions criteria set by the ETSU Graduate School, the following is required: an application a virtual interview a résuméor curriculum vitae Factors considered in the admission decision include the applicants educational goals and demonstrated ability to succeed in the program. Program of Study Each student will design a program of study to includethe requiredcourses and one 3-credit elective from the approved list of electives. Course Requirements A minimum of thirteen (13) credits is required for the Health Care Management Graduate Certificate. Upon admission to the program, an individualized program of study is designed based upon evaluation of previous coursework and professional experience. Coursework previously counted toward an earned degree or an earned certificate may not be transferred into the Health Care Management Graduate Certificate Program. Upon successful completion of the program ofstudy, students will receive a certificate of completion in Health Care Management. For information and application materials, contact: East Tennessee State University Health Care Management Graduate Certificate Program Box 70264 Johnson City, TN 37614 Attn: Jennifer Hunt, MPH Phone: (423) 439-6135 e-mail: PublicHealth@etsu.edu Articulation Agreement Students who have completed the Health Care ManagementGraduate Certificate and subsequently are admitted into the Master of Health Administration may have up to thirteen (13) of the certificate credits applied toward the degree program of study as long as the courses fall within the matriculation limits and a grade of B (3.0) or better was earned for the course. Students who have completed the Health Care ManagementGraduate Certificate may apply, with approval, up to thirteen (13) credits of coursework in the certificate programinto the M.P.H., M.B.A., or M.S.N. degree programs. Students who have completed the Health Care ManagementGraduate Certificate and subsequently are admitted into the MPH in Public Health Leadership and Policy may have up to thirteen ( 13 ) of the certificate credits applied toward the degree program of study as long as the courses fall within the matriculation limits and a grade of B (3.0) or better was earned for the course. Health Care Management, Graduate Certificate Requirements: 13 credits Required Courses 10 credits Advisor Approved Electives 3 credits TOTAL 13 credits Required Courses: 10 credits HSMP 5040-Health Systems, Regulations, and Policies (4 credits) HSMP 5050-Health Care Accounting and Finance (3 credits) HSMP 5550-Human Resource Management in Health Organizations (3 credits) Advisor Approved Electives: 3 credits Choose 3 creditsfrom the following: ECON 5317-Health Care Economics (3 credits) HSMP 5150-Health Care Financial Management (3 credits) HSMP 5300-Quality Improvement in Health Services Organizations (3 credits) HSMP 5525-Health Services Organization and Delivery (3 credits) HSMP 5535-Health Policy, Politics, and Analysis (3 credits) HSMP 5400-Data Informed Decision-Making in Health Administration (3 credits) HSMP 5530-Health Care Organizations and Law (3 credits) HSMP 5590-Strategic Planning for Health Care (3 credits) HSMP 5700-Studies in Health Administration (3 credits) Health Care Management, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16897&returnto=3119",
        "document_content": "General Information Mike Smith, DrPH, Health Data Analytics Certificate Coordinator 148 Sam Wilson Hall email: smithmg1@etsu.edu (423) 439-4443 The Health Data Analytics Graduate Certificate is a 13-credit program of study that provides a graduate-level foundation in data analytics principles and techniques necessary to develop and improve health systems, health programs, and health policies.The program includes courses from multiple disciplines (health services research, epidemiology, biostatistics, and computer science)to equip learners with a broad base of knowledge they can apply in a variety of health service organizations. The Health Data Analytics Graduate Certificate is available on campus and fully online. Admission Requirements In addition to the admissions criteria set by the ETSU School of Graduate Studies, the following isrequired: a resume or curriculum vitae. Articulation Agreement A student who completes the Graduate Certificate in Health Data Analytics and wishes to pursue the Master of Public Health may apply the certificate credits into the masters degree with approval of the degree graduate coordinator and the School of Graduate Studies. Health Data Analytics, Graduate Certificate Requirements: 13 credits Required Courses 10 credits Advisor Approved Electives 3 credits TOTAL 13 credits Required Courses: 10 credits EPID 5100-Analytic Methods in Public Health (4 credits) HSMP 5400-Data Informed Decision-Making in Health Administration (3 credits) CSCI 5050-Decision Support Systems (3 credits) Advisor Approved Electives: 3 credits Choose 3 credits from the following: BSTA 5350-Intermediate Biostatistics (3 credits) BSTA 5360-Clinical Research: Design and Analysis (3 credits) BSTA 5380-SAS Programming with Statistical Application (3 credits) BSTA 6170-SAS Programming with Research Applications in Public Health (3 credits) CSCI 5000-Data Management (3 credits) CSCI 5250-Database Design (3 credits) HSMP 5300-Quality Improvement in Health Services Organizations (3 credits) HSMP 6310-Population Health Management (3 credits) Health Data Analytics, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16932&returnto=3119",
        "document_content": "General Program Information Department of Literature and Language POBox 70683 Phone: (423) 439-4347 Web Address: www.etsu.edu/cas/litlang Katrina Heil, Ph.D., Professor 213B Gilbreath Hall 423-439-8343 e-mail: heil@etsu.edu Daniel Westover, Ph.D., Department Chair 103ABurleson Hall Box 70683 (423) 439-6626 e-mail: westover@etsu.edu The Graduate Certificate in Healthcare Spanish is intended for graduate studentsin the health professions at ETSU. Thiscertification program prepares health professionals to interact with Spanish-speaking patients and their families through acquisition of the necessary level of speaking and listening proficiency in Spanish, especially with terminology and grammar structures used in a healthcare setting,as well asa solid understanding of social and culturalissues related to the Hispanic population and healthcare. Program Admission Requirements Students must meet the Graduate School admission requirements. Articulation Agreement Quillen College of Medicine Students may take MEDU 5009 for the Healthcare Spanish Immersion Elective. During the 3rd and 4th years in medical school, the student will complete at least 4 weeks of full-time clinical rotations in a setting where Spanish is the predominant (e.g., Morristown, Tennessee) or exclusive (e.g., USFQ rotation in Quito, Ecuador) language spoken. Bill Gatton College of Pharmacy Students may take APPE 6507, APPE 7038, APPE 7062, or APPE 7066during the 4th year in a setting where Spanish is the predominant or exclusive language spoken to satisfythe Healthcare Spanish Immersion Elective requirement.This could be a domestic or international experience. Specific experience and site will be determined by the BGCOP Office of Experiential Education. Healthcare Spanish, Graduate Certificate Requirements: 12-13 credits Required Course 9 credits Elective 3-4 credits Total 12-13 credits Required Courses: 9 credits SPAN 5011-Intensive Healthcare Spanish I for Graduate Students (3 credits) SPAN 5021-Intensive Healthcare Spanish II for Graduate Students (3 credits) SPAN 5123-Spanish for Health Equity (3 credits) Healthcare Spanish Immersion Elective: 3-4 credits Choose one of the following: SPAN 5157-Spanish for Health Professions (3 credits) SPAN 5377-Language and Culture in Ecuador (3 credits) SPAN 5957-Topics in Spanish (1-6 credits) (take for 3 credits) MEDU 5009 Global Health Elective (4 credits)(for Quillen College of Medicine students) APPE 6507 Community Practice II (4 credits)(for Bill Gatton College of Pharmacy students) APPE 7038Global Health Initiatives (4 credits)(for Bill Gatton College of Pharmacy students) APPE 7062Global Health Initiatives (4 credits)(for Bill Gatton College of Pharmacy students) APPE 7066Public Health (4 credits)(for Bill Gatton College of Pharmacy students) Healthcare Spanish, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16898&returnto=3119",
        "document_content": "General Program Information Department of Appalachian Studies Department Chair and Graduate Coordintor: Ron Roach, Ph.D. 222 Nicks Hall Box 70556 (423) 439-7494 e-mail: roachr@etsu.edu Faculty: Appalachian Studies: Lee Bidgood; Rebecca Fletcher; Jane MacMorran; Nate Olson; Ted Olson; Ron Roach; Communication and Storytelling Studies: Amber Kinser, Delanna Reid; History: Tom Lee, Steve Nash; additional faculty in other academic units who teach related courses. This interdisciplinary graduate certificate represents a partnership between several academic departments and units, including Appalachian Studies, Biological Sciences, Communication Studies, Geosciences, History, Liberal Studies, and Sociology and Anthropology. The Heritage Interpretation and Museum Studies Graduate Certificate is a 21-credit interdisciplinary program for students who would like to increase their knowledge of museum studies and heritage interpretation. The certificate prepares students to pursue a career in a museum, heritage site, or similar organization. The certificate may also prepare students to pursue additional graduate studies in heritage interpretation, museum studies, public history, or related fields. The certificate is also quite helpful to those who are already working in the field and wish to enhance their professional skills or credentials. Northeast Tennessee is home to a large number of museums and heritage sites, and cultural heritage tourism is one of the most important and fastest-growing segments of the regions economy. This certificate provides knowledge and skills for students interested in this field. This program is distinguished from similar programs in that it strongly emphasizes the communication and storytelling skills that are essential to the creative interpretation of natural and cultural resources. Heritage interpretation is the way in which natural, cultural, or historic resources are presented to the public, helping them to experience the resources, discover meaning, and form connections. The United Nations Educational, Scientific, and Cultural Organization (UNESCO) defines heritage as “the legacy that we receive from the past, that we experience in the present, and that we will pass on to future generations.” Heritage encompasses both natural heritage (features of the natural landscape) and cultural heritage (the whole range of cultural resources created or built by humans in the past). How a community interprets and uses its heritage plays an important role in sustainable developmentby helping to build a sense of community among diverse groups and individuals,creating jobs and economic growth through heritage tourism,building respect for history and for cultural and social diversity,and challenging prejudice and stereotypes. This graduate certificate can be an excellent complement to masters degrees or graduate certificates in several disciplines, including anthropology,Appalachian studies,archival studies, biological sciences, communication and storytelling studies,geosciences,history,public administration,sociology,and storytelling. Admission Requirements In addition to the admissions criteria set by the ETSU School of Graduate Studies, the following are required: Three letters of recommendation from academic or professional mentors or associates. A formal writing sample, such as a paper previously submitted for credit in an undergraduate or graduate course. Articulation Agreement A student who completes the graduate certificate in Heritage Interpretation and Museum Studies and later wishes to pursue the MA in Appalachian Studies may apply up to 18 certificate credits into the masters degree with the approval of the degree graduate coordinator and the School of Graduate Studies. Allcredit, however, must meet GPA requirements and must be within the six-year matriculation limits. A student who completes the graduate certificate in Heritage Interpretation and Museum Studies and later wishes to pursue the MA inCommunication and Storytelling Studies may apply up to 18 certificate credits into the masters degree with the approval of the degree graduate coordinator and the School of Graduate Studies. Allcredit, however, must meet GPA requirements and must bewithin the six-year matriculation limits. A student who completes the graduate certificate in Heritage Interpretation and Museum Studies and later wishes to pursue the MA in Liberal Studies may apply up to 12 certificate credits into the masters degree with the approval of the degree graduate coordinator and the School of Graduate Studies. All credit, however, must meet GPA requirements and must bewithin the six-year matriculation limits. A student who completes the graduate certificate in Heritage Interpretation and Museum Studies and later wishes to pursue the MA in Historyvia the non-thesis track may applyup to 12 Historycertificate credits into the masters degree with the approval of the degree graduate coordinator and the School of Graduate Studies. All credit, however, must meet GPA requirements and must bewithin the six-year matriculation limits. Heritage Interpretation and Museum Studies, Graduate Certificate Requirements: 21 credits Required Courses 9 credits Advisor Approved Electives 9 credits Practicum/Internship 3 credits TOTAL 21 credits Required Courses: 9 credits APST 5310-Museum and Heritage Site Administration (3 credits) HIST 5540-Public History: Theory and Practice (3 credits) STOR 5140-Foundations of Storytelling Performance (3 credits) Advisor Approved Electives: 9 credits Choose 9 credits from the following areas, based on interest and professional goals: Communication and Storytelling COMM 5250-Issues in Communication and Culture (3 credits) STOR 5230-Advanced Storytelling Performance (3 credits) STOR 5840-Story Dramatization (1-3 credits) Other courses as approved by advisor Environment and Natural Heritage APST 5210-Environment and Sustainability in Appalachia (3 credits) BIOL 5247-Appalachian Flora (3 credits) BIOL 5257-Appalachian Fauna (3 credits) Other courses as approved by advisor History and Cultural Heritage APST 5337-Appalachia in Scotland and Ireland (3-6 credits) APST 5690-Appalachian Community Engagement (3 credits) APST 5957-Special Topics in Appalachian Studies (1-3 credits) (When topic is ‘Tourism in Appalachia) HIST 5541-Historic Site Interpretation (3 credits) ANTH 5627-Ethnographic Methods (3 credits) Other courses as approved by advisor Museum Studies and Heritage Management ANTH 5027-Cultural Resource Management (3 credits) AVST 5310-Archives History, Theory, and Current Issues (3 credits) AVST 5311-Archives Principles and Practices (3 credits) GEOS 5200-Topics in Paleontology (3 credits) (When topic is ‘Natural History Museum Techniques) HIST 5957-Topics in History (1-6 credits) (When topic is ‘The 21 st Century Museum Experience) PMGT 5100-Introduction to Public Administration (3 credits) Other courses as approved by advisor Practicum/Internship: 3 credits Taken in the appropriate department, according to student interest and professional goals. Heritage Interpretation and Museum Studies, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16909&returnto=3119",
        "document_content": "General Program Information Dr. Jill Channing, Graduate Coordinator 514Warf Pickel Hall (423) 439-7545 Email: channing@etsu.edu The Higher Education TeachingGraduate Certificate Program is a 15-credit program of study designed to provide the learner with specificpedagogicaland curriculum designtools for the higher education environment. The focus of the program is to further educate college and university faculty and thosewho seek higher education teaching positions. Admission Requirements In addition to the admissions criteria set by the Graduate School, the following will be required for consideration for acceptance into this certificate program: Demonstrate an interest in higher education teaching; Have at least a 3.0 on a 4.0 scale in the most current awarded degree; Possess a graduate degree or concurrent enrollment in a graduate degree with completion of at least one semester of study. Application materials to be submitted to the Graduate School include: An application; A one-page letter (essay) stating interest in the Higher Education Teachinggraduate certificate program; Transcripts from all institutions of higher education attended; A vita or resume with a list of two professional references including contact information All applications will be evaluated by an admission committee composed of faculty members of the Department of Educational Leadership and Policy Analysis. Applicants will be evaluated on (1) GPA in most recent degree; (2) professional work experience; (3) prior teaching positions/demonstrated interestin higher education teaching; and (4) writing ability. Applicants are encouraged to address their related accomplishments, goals, and interest in higher education teachingin the essay and in their vita. Articulation Agreements Students pursuing the Graduate Certificate in Higher Education Teaching who complete ALHE 5010 and/or ALHE 5060 may also apply these courses toward the Masterof Science in Allied Health degree in the College of Clinical and Rehabilitative Health Sciences. Students completing the Higher Education Teaching Certificate may apply up to nine credits from the certificate into the Psychology PhD Clinical and Eperimental concentrations with advisor approval if admitted to the program, as long as the courses fall within the matriculationlimits. Students who have completed the Higher Education Teaching, Graduate Certificate and subsequently are admitted into the Ed.D. Educational Leadership (Higher Education Leadership Concentration) may have up to fifteen(15) of the certificate credits applied toward the degree program of study as long as the courses fall within the matriculation limits,a grade of B (3.0) or better was earned for the course, and courses taken as electives in the Higher Education Teaching, Graduate Certificate areapproved by the Higher Education Leadership program coordinator for articulation. Higher Education Teaching, Graduate Certificate Requirements: 15 credits Required Courses 9 credits Advisor Approved Electives 6 credits TOTAL 15 credits Required Courses: 9 credits ELPA 6230-High-Impact Higher Education Instructional Practices (3 credits) ELPA 6563-The Adult Learner (3 credits) Choose from one of the following : ELPA 5820-Higher Education in America (3 credits) ELPA 7110-Community Colleges in the United States (3 credits) ELPA 7120-History of American Higher Education (3 credits) Advisor Approved Electives: 6 credits Any course with advisor approval (6 credits) Higher Education Teaching, Graduate Certificate"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16925&returnto=3119",
        "document_content": "General Program Information Department of History General Information 119 Rogers-Stout Hall / P.O. Box 70672 Johnson City, TN 37614 423-439-4222 William Douglas Burgess, Ph.D., Department Chair 119 Rogers-Stout Hall Box 70672 423-439-4222 Email: burgessw@etsu.edu Dinah Mayo-Bobee, PhD. Graduate Certificate Coordinator Department of History 119 Rogers Stout Hall (423) 439-6696 Email: mayobobee@etsu.edu The Department of History offers a Graduate Certificate in history that provides an array of courses for students interested in graduate-level studies in American, European, and World History. The certificate allows students to research historical topicswith a focus oncultural, intellectual, political, social, and public history. Students can also complete courses across a range of topics for academic, personal, and professional development. Admission Requirements In addition to the admissions criteria set by the ETSU School of Graduate Studies, the following will be required: Minimum grade point average of 3.0 on a 4.0 scale Personal statement or application essayno more than 500 words explaining qualifications, reason for seeking the certificate, and specific area(s) of history that will be studied (if applicable). Three letters of recommendation, from current or formerprofessors, or professional recommendations from supervisors or colleagues. A resume or CV Application materials must be submitted to the School of Graduate Studies. Current graduate students at ETSUneed to submit all application materials listed aboveand a Dual Degree form . Application Due Dates Fall Enrollment August 1 Spring Enrollment January 1 Application Assessment and Review All applications will be evaluated by the Department of History Graduate Committee and Graduate Program Coordinator. Along with your GPA and recommendations, consideration will be given to your application essay including your writing skills, the identification of a specific area of history and time period you wish to study, and the name(s) of Department of History faculty with whom you would like to work. If you wish to study more than one area of history, explainin your essay how doing so will help accomplish your goals. Potential students can also address personal and professional accomplishments and explain how the certificate will be valuable. Articulation Agreement A student who completes the Graduate Certificate in History and later wishes to pursue the MA in History may apply up to 12 certificate credits into the masters program with approval of the Department of History Graduate Coordinator and the School of Graduate Studies.Only credits that meet GPA requirements and are completed within the ETSU six-year matriculation period will be accepted. History, Graduate Certificate Requirements: 12 credits Core Requirement 3 credits Advisor Approved Electives 9 credits TOTAL 12 credits Required Course: 3 credits Choose one. HIST 5940-Studies in Historiography (3 credits) OR HIST 5950-Introduction to Historical Research (3 credits) Advisor Approved Elective Courses: 9 credits Choose three courses for nine credits. Students may apply only one dual-listed (4xx7/5xx7) course to completing this certificate. For HIST 5940 or HIST 5950, onecan be used as an elective if not taken as the required course. HIST 5010-Studies in United States History (3 credits) HIST 5020-Studies in European History (3 credits) HIST 5030-Studies in World History (3 credits) HIST 5047-The Early Republic (3 credits) HIST 5067-The Civil War Era (3 credits) HIST 5077-American History through Film (3 credits) HIST 5247-History of Women in U.S. to 1945 (3 credits) HIST 5257-History of Women in Appalachia (3 credits) HIST 5267-Constitutional History: Congress, the Law and Slavery (3 credits) HIST 5277-Foreign Policy in the Early Republic (3 credits) HIST 5287-Topics in American History (3 credits) HIST 5387-History of the Holocaust (3 credits) HIST 5540-Public History: Theory and Practice (3 credits) HIST 5541-Historic Site Interpretation (3 credits) HIST 5560-Sherrod-History Graduate Research Practicum (3 credits) HIST 5717-Modern Middle East (3 credits) HIST 5727-Modern Africa (3 credits) HIST 5837-Women Since 1945 (3 credits) HIST 5847-American Sports 20th Century to Present (3 credits) HIST 5900-Independent Studies (1-3 credits) HIST 5927-World War II in Europe (3 credits) HIST 5937-World War II in the Pacific (3 credits) Any HIST 5000-level course (3 credits) History, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16934&returnto=3119",
        "document_content": "General Program Information Teresa Boggs Ph.D., Graduate Coordinator Lamb Hall Room 371 Phone: 423-439-4535 Email: boggs@etsu.edu website: https://www.etsu.edu/crhs/aslp/speechpathology/ The Interprofessional Pediatric Feeding Graduate Certificate is a 9-credit fully online program of study designed to develop clinical expertise in teams from multiple disciplines to provide evaluation and intervention to an under-identified and underserved population: young children with disorders related to feeding.The program provides training for interprofessional teams through didactic and practical educational experiences, in a model incorporating problem-based learning, team-building/networking, and leadership in interprofessional education and practice. Admission Requirements In addition to the admissions criteria set by the ETSU Graduate School, the following will be required: Hold licensure/certification as, or be in pursuit of, licensure/certification in a clinical discipline related to Pediatric Feeding Disorders, includingbut not limited to Speech-Language Pathology, Occupational Therapy, Nutrition, Nursing, Education, or Medicine. Interprofessional Pediatric Feeding, Graduate Certificate Requirements: 9 credits Required Courses 9 credits Total 9 credits Required Courses: 9 credits CDIS 5301-Pediatric Feeding Development and Disorders (3 credits) CDIS 5302-Pediatric Feeding Assessment and Intervention (3 credits) CDIS 5303-Interprofessional Teams in Pediatric Feeding (2 credits) CDIS 5304-Pediatric Feeding Clinical Practicum (1 credit) Interprofessional Pediatric Feeding, Graduate Certificate (Online)"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16923&returnto=3119",
        "document_content": "General Program Information Bethany Novotny, Ph.D., GraduateCoordinator Department of Counseling and Human Services Box 70701 (423) 439-7073 email: novotny@etsu.edu The graduate certificate in Nature-Based Therapy provides a foundation of knowledge and skill fundamental to any nature-based therapeutic setting. This certificate critically examines a wide array of nature-based therapeutic contexts and perspectives. The certificate offers a comprehensive preparation for the creation of nature-based therapeutic services and programming, as well as for the integration of nature-based therapeutic practices into traditional approaches. In addition, the certificate develops skills relevant to individual and community healing, development, and wellness, including practical skills for programming logistics, implementation, administration, and risk management. Additional topics covered throughout the certificate include ecopsychology, ecotherapy, Leave No Trace (LNT) philosophy, land stewardship practices, common US nature-based program models, multicultural perspectives in nature-based therapeutics, and outdoor behavioral healthcare. Admission Requirements In addition to the admissions criteria set by the ETSU School of Graduate Studies , the following will be required: Two letters of recommendation Nature-Based Therapy, Graduate Certificate Requirements: 15 credits Required Courses 12 credits Advisor Approved Elective 3 credits TOTAL 15 credits Required Courses: 15 credits HSRV 5110-Introduction to Nature Connection (3 credits) HSRV 5130-Nature-Based Therapy: Theory and Practice (3 credits) HSRV 5220-Nature-Based Programming, Planning, and Implementation (3 credits) HSRV 5500-Nature-Based Immersion (3 credits) Advisor Approved Elective: 3 credits Students must choose one of the following: COUN 6585-Trauma and Recovery (3 credits) COUN 5549-Substance Abuse: Counseling Individuals and Families (3 credits) COUN 5100-Groups: Processes and Practice (3 credits) HSRV 5510-Grant and Report Writing (3 credits) ELPA 6450-Leadership Studies (3 credits) ECED 6200-Implications and Current Trends in Typical and Atypical Development of Young Children (3 credits) Nature-Based Therapy, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16855&returnto=3119",
        "document_content": "General Program Information Dr. Lisa Haddad,PhD, RN, Associate Dean of Graduate Programs 207 Roy S. Nicks Hall Box 70619 (423) 439-5626 e-mail: HaddadL@etsu.edu Dr. Bernita Armstrong, DNP, APN-BC, MN, DNP Program Director, Interim Coordinator Roy S. Nicks Hall Box 70629 (423) 439-5892 e-mail: armstrongb@etsu.edu The Adult/Gerontology Primary Care Nurse Practitioner (AGPCNP) certificate offers a Post-D.N.P. certificate for nurses who have completed a D.N.P. degree in nursing. This customized special studies program provides education and clinical training in the AGPCNP role. Upon completion of the program, graduates are eligible for the national certification examinationand to assume practice and leadership positions in population- focused health care teams. For application terms and deadlines please refer to the College of Nursing website. Admission Requirements Students may be admitted to the Post-D.N.P. Graduate Certificate programs in one of two ways: as D.N.P. degree-holding applicants. These individuals must hold the earned D.N.P. degree with a designated concentration in advanced clinical practice or nursing administration; OR as concurrently enrolled ETSU D.N.P. degree program students. Concurrently enrolled ETSU D.N.P. degree program students must: be in academic good standing; and have completed BSTA 5310 or equivalent; NRSE 5000; NRSE 5001; for the Nurse Practitioner Post-D.N.P. Graduate Certificate programs (FNP, A/GNP, or PMHNP), have completed NRSE 5009; NRSE 5010; NRSE 5016 or in progress; and NRSE 5018 or in progress. Applicants seeking admission to the Post-D.N.P. Graduate Certificate programs must fulfill all the requirements for admission to both the ETSU School of Graduate Studies and the CON. The School of Graduate Studies requires that all students submit the following materials: a completed application with payment of nonrefundable application fee; transcripts of all previous undergraduate and graduate coursework; a written essay. Additional requirements for admission to the Post-D.N.P. Graduate Certificate programs include: Licensure as a Registered Nurse in the United States and eligibility for licensure in Tennessee or equivalency for international students; A cover letter expressing the applicants personal goals for Post-D.N.P. Graduate Certificate study; A current resume or vita. Earned D.N.P. degree with a designated concentration in advanced clinical practice or nursing administration. Transcript documentation of content equivalent to the D.N.P. degree program core (26 credits) is required for all D.N.P. degree-holding applicants. Students without this content will be required to take courses from the D.N.P. degree core to make up any deficiencies. For the Nurse Practitioner Post-D.N.P. Graduate Certificate programs (FNP, A/GNP, or PMHNP), transcript documentation of content equivalent to NRSE 5009; NRSE 5010; NRSE 5016; and NRSE 5018, the Advanced Practice Nursing Core (12 credits) is required. Applicants without this content will be required to take the missing coursework; OR Concurrently enrolled ETSU D.N.P. degree program student with completion of BSTA 5310 or equivalent; NRSE 5000; NRSE 5001; and for the Nurse Practitioner Post-D.N.P. Graduate Certificates (FNP, A/GNP, or PMHNP), completion of NRSE 5009, NRSE 5010, NRSE 5016 or in progress, and NRSE 5018 or in progress. Progression Policy Students in graduate nursing programs must meet the requirements of the School of Graduate Studies to remain in good standing. An overall grade point average (GPA) of 3.0 (B) or better must be maintained. In addition, a nursing student must achieve a “B” or better in every graduate nursing course. Policies of the School of Graduate Studies for progression will apply. Students who receive less than a “B” in a course will have one opportunity to repeat the course. If a students cumulative grade point average falls below 3.0, she/he will be placed on academic probation the following semester. If the student does not achieve a 3.0 cumulative grade point average at the conclusion of one probationary semester, the Dean of the School of Graduate Studies and the Associate DeanGraduate Programs in the College of Nursing will determine if the student should be dismissed from graduate study or continued on academic probation. No student will be allowed more than two probationary semesters, whether consecutive or cumulative. At the end of a second probationary semester, a student whose cumulative grade point average is still below 3.0 will be dismissed from graduate study. Students whose performance results in a GPA so far below 3.0 as to make it mathematically impossible to attain an overall GPA of 3.0 after one semester may be subject to dismissal without a probationary term. An incomplete grade (“I”) indicates that the student was passing the course at the end of the semester, but due to circumstances beyond the students control, was unable to complete the course work for which the “I” is assigned. The “I” grade cannot be used to allow a student to do additional work to raise a deficient grade or to repeat a course. An “I” grade must be removed no later than one calendar year from the time the grade is awarded. Students with more than one “I” grade cannot progress in the program. Time extension requests for removal of an “I” grade must be submitted to and approved by the Dean of the School of Graduate Studies before the allotted time expires. An “I” grade not removed under the guidelines in the Graduate Catalog will be converted to an “F.” Students may have grades of “WF” in no more than one semester within an academic year. Students must maintain an unencumbered registered nurse license in all states where they are currently licensed throughout the duration of the graduate program and in the state(s) where they fulfill clinical course requirements. If at any time during enrollment in the graduate program a students nursing license becomes encumbered, is suspended, or revoked, the student must immediately report this to the Associate DeanGraduate Programs in the College of Nursing. If a students registered nurse license is suspended or revoked, or if a student fails to report any changes in licensure status to the Associate Deanof Graduate Programs, the student will be administratively withdrawn from the graduate program. A students ability to continue enrollment in the graduate program with an encumbered license will be reviewed on an individual basis considering the restriction/limitations placed on the students practice as a registered nurse by the board of nursing in the state issuing the encumbered license. Grade Scale: A=93-100; B=84-92; C=75-83; F=less than 75.Grades maybe rounded at the discretion of the faculty. The student is referred to the Graduate Catalog for more detailed progression information. Post-D.N.P. Adult/Gerontological Nurse Practitioner, Graduate Certificate Requirements: 32 credits Required Courses 32 credits TOTAL 32 credits Required Courses: 32 credits NRSE 5011-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner I (3 credits) NRSE 5012-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner I Practicum (3 credits) NRSE 5013-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner II (3 credits) NRSE 5014-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner II Practicum (3 credits) NRSE 5021-Life Span Assessment and Clinical Management: Womens Health (2-3 credits) NRSE 5022-Life Span Assessment and Clinical Management: Womens Health Practicum (3 credits) NRSE 5031-Care of Older Adults with Chronic Health Problems and Complex Needs (3 credits) NRSE 5032-Care of Older Adults with Chronic Health Problems and Complex Needs Practicum (3 credits) NRSE 5038-Pharmacology and Therapeutics for Older Adults (2 credits) NRSE 6400-Improving Mental Health Outcomes in Primary Care (3 credits) NRSE 6514-DNP Role in Long-Term Care of Adults (3 credits) Nursing, Post-D.N.P. Adult/Gerontological Nurse Practitioner, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16749&returnto=3119",
        "document_content": "General Program Information Dr. Lisa Haddad, PhD, RN, Associate Dean of Graduate Programs 207 Roy S. Nicks Hall Box 70629 (423) 439-5626 e-mail: HaddadL@etsu.edu Dr. Bernita Armstrong, DNP, APN-BC, MN, DNP Program Director, Interim Coordinator Roy S. Nicks Hall Box 70629 (423) 439-5892 e-mail: armstrongb@etsu.edu The Post-Graduate Family Nurse Practitioner certificate offers a Post-Masters certificate for nurses who have completed a Master of Science in Nursing degree. This customized special studies program provides education and clinical training in the FNP role. Upon completion of the program, graduates are eligible for the national certification examinationand to assume practice and leadership positions in the healthcare team. Prospective students must submit a completed application to the School of Graduate Studies which includes official transcripts from all previous undergraduate and graduate coursework, a completed personal essay, a vitae/résumé, and three (3) professional letters of recommendation. GRE reports are not required. Criteria for admission includes: A Master of Science in Nursing (M.S.N.) from a program accredited by the National League for Nursing Accrediting Commission (NLNAC) or the Commission on Collegiate Nursing Education (CCNE); A “B” average (3.0 on a 4.0 scale) in the nursing major; and Licensure in the United States as a registered nurse and eligibility for licensure in Tennessee or compact state. Admission to the post-masters certificate program will be accomplished in the same manner as for the masters nursing degree program. A minimum of twenty-four(24) credits is required for the certificate in Advanced Nursing Practice. For application terms and deadlines please refer to the College of Nursing website. Progression Policy Students in graduate nursing programs must meet the requirements of the School of Graduate Studies to remain in good standing. An overall grade point average (GPA) of 3.0 (B) or better must be maintained. In addition, a nursing student must achieve a “B” or better in every graduate nursing course. Policies of the School of Graduate Studies for progression will apply. Students who receive less than a “B” in a course will have one opportunity to repeat the course. If a students cumulative grade point average falls below 3.0, she/he will be placed on academic probation the following semester. If the student does not achieve a 3.0 cumulative grade point average at the conclusion of one probationary semester, the Dean of the School of Graduate Studies and the Associate DeanGraduate Programs in the College of Nursing will determine if the student should be dismissed from graduate study or continued on academic probation. No student will be allowed more than two probationary semesters, whether consecutive or cumulative. At the end of a second probationary semester, a student whose cumulative grade point average is still below 3.0 will be dismissed from graduate study. Students whose performance results in a GPA so far below 3.0 as to make it mathematically impossible to attain an overall GPA of 3.0 after one semester may be subject to dismissal without a probationary term. An incomplete grade (“I”) indicates that the student was passing the course at the end of the semester, but due to circumstances beyond the students control, was unable to complete the course work for which the “I” is assigned. The “I” grade cannot be used to allow a student to do additional work to raise a deficient grade or to repeat a course. An “I” grade must be removed no later than one calendar year from the time the grade is awarded. Students with more than one “I” grade cannot progress in the program. Time extension requests for removal of an “I” grade must be submitted to and approved by the Dean of the School of Graduate Studies before the allotted time expires. An “I” grade not removed under the guidelines in the Graduate Catalog will be converted to an “F.” Students may have grades of “WF” in no more than one semester within an academic year. Students must maintain an unencumbered registered nurse license in all states where they are currently licensed throughout the duration of the graduate program and in the state(s) where they fulfill clinical course requirements. If at any time during enrollment in the graduate program a students nursing license becomes encumbered, is suspended, or revoked, the student must immediately report this to the Associate DeanGraduate Programs in the College of Nursing. If a students registered nurse license is suspended or revoked, or if a student fails to report any changes in licensure status to the Associate Deanof Graduate Programs, the student will be administratively withdrawn from the graduate program. A students ability to continue enrollment in the graduate program with an encumbered license will be reviewed on an individual basis considering the restriction/limitations placed on the students practice as a registered nurse by the board of nursing in the state issuing the encumbered license. Grade Scale: A=93-100; B=84-92; C=75-83; F=less than 75.Grades maybe rounded at the discretion of the faculty. The student is referred to the Graduate Catalog for more detailed progression information. Post-Graduate Family Nurse Practitioner, Graduate Certificate Requirements: 24 credits Required Courses 24 credits TOTAL 24 credits Required Courses: 24 credits NRSE 5011-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner I (3 credits) NRSE 5012-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner I Practicum (3 credits) NRSE 5013-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner II (3 credits) NRSE 5014-Health Promotion, Diagnosis, Treatment, and Clinical Management: Nurse Practitioner II Practicum (3 credits) NRSE 5021-Life Span Assessment and Clinical Management: Womens Health (2-3 credits) NRSE 5022-Life Span Assessment and Clinical Management: Womens Health Practicum (3 credits) NRSE 5023-Health Promotion Diagnosis and Clinical Management of Children and Adolescents (3 credits) NRSE 5024-Health Promotion, Diagnosis and Clinical Management of Children and Adolescents Practicum (3 credits) Total Contact Hours - Advance Family NP Clinical/Practicum: 780 Hours Nursing, Post-Graduate Family Nurse Practitioner, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16836&returnto=3119",
        "document_content": "General Program Information Dr. Lisa Haddad, PhD, RN, Associate Dean of Graduate Nursing Programs 207 Roy S. Nicks Hall Box 70658 (423) 439-4589 e-mail: HaddadL@etsu.edu Dr. Bernita Armstrong, DNP, APN-BC, MN, DNP Program Director Roy S. Nicks Hall Box 70629 (423) 439-5892 e-mail: armstrongb@etsu.edu Dr. Nancy Cameron, D.S., M.S.N., R.N., Graduate Coordinator 2-209Roy S. Nicks Hall Box 70629 (423) 439-4874 e-mail: cameronng@etsu.edu The Post-Graduate Nursing Administration certificate offers a Post-Masters certificate for nurses who have completed a Master of Science in Nursing degree. This customized special studies concentration provides education and training in the nurse administrator role. The Certificate Program provides an individualized experience through which students gain a strong foundation incomplex systems, organizational theory, financial management, and leadership practice. Prospective students must submit a completed application to the School of Graduate Studies which includes official transcripts from all previous undergraduate and graduate coursework, a completed personal essay, a vitae/résumé, and three (3) professional letters of recommendation. GRE reports are not required. Criteria for admission includes: A Master of Science in Nursing (M.S.N.) from a program accredited by the National League for Nursing Accrediting Commission (NLNAC) or the Commission on Collegiate Nursing Education (CCNE); A “B” average (3.0 on a 4.0 scale) in the nursing major; and Licensure in the United States as a registered nurse and eligibility for licensure in Tennessee or compact state. Admission to the post-masters certificate program will be accomplished in the same manner as for the masters nursing degree program. A minimum of twenty-four(24) credits is required for the certificate in Advanced Nursing Practice. For application terms and deadlines please refer to the College of Nursing website. Progression Policy Students in graduate nursing programs must meet the requirements of the School of Graduate Studies to remain in good standing. An overall grade point average (GPA) of 3.0 (B) or better must be maintained. In addition, a nursing student must achieve a “B” or better in every graduate nursing course. Policies of the School of Graduate Studies for progression will apply. Students who receive less than a “B” in a course will have one opportunity to repeat the course. If a students cumulative grade point average falls below 3.0, she/he will be placed on academic probation the following semester. If the student does not achieve a 3.0 cumulative grade point average at the conclusion of one probationary semester, the Dean of the School of Graduate Studies and the Associate DeanGraduate Programs in the College of Nursing will determine if the student should be dismissed from graduate study or continued on academic probation. No student will be allowed more than two probationary semesters, whether consecutive or cumulative. At the end of a second probationary semester, a student whose cumulative grade point average is still below 3.0 will be dismissed from graduate study. Students whose performance results in a GPA so far below 3.0 as to make it mathematically impossible to attain an overall GPA of 3.0 after one semester may be subject to dismissal without a probationary term. An incomplete grade (“I”) indicates that the student was passing the course at the end of the semester, but due to circumstances beyond the students control, was unable to complete the course work for which the “I” is assigned. The “I” grade cannot be used to allow a student to do additional work to raise a deficient grade or to repeat a course. An “I” grade must be removed no later than one calendar year from the time the grade is awarded. Students with more than one “I” grade cannot progress in the program. Time extension requests for removal of an “I” grade must be submitted to and approved by the Dean of the School of Graduate Studies before the allotted time expires. An “I” grade not removed under the guidelines in the Graduate Catalog will be converted to an “F.” Students may have grades of “WF” in no more than one semester within an academic year. Students must maintain an unencumbered registered nurse license in all states where they are currently licensed throughout the duration of the graduate program and in the state(s) where they fulfill clinical course requirements. If at any time during enrollment in the graduate program a students nursing license becomes encumbered, is suspended, or revoked, the student must immediately report this to the Associate DeanGraduate Programs in the College of Nursing. If a students registered nurse license is suspended or revoked, or if a student fails to report any changes in licensure status to the Associate Deanof Graduate Programs, the student will be administratively withdrawn from the graduate program. A students ability to continue enrollment in the graduate program with an encumbered license will be reviewed on an individual basis considering the restriction/limitations placed on the students practice as a registered nurse by the board of nursing in the state issuing the encumbered license. Grade Scale: A=93-100; B=84-92; C=75-83; F=less than 75.Grades maybe rounded at the discretion of the faculty. The student is referred to the Graduate Catalog for more detailed progression information. Post-Graduate Nursing Administration, Graduate Certificate Requirements: 24 credits Required Courses 24 credits TOTAL 24 credits Required Courses: 24 credits NRSE 5501-Leadership in Nursing Administration (3 credits) NRSE 5502-Executive Leadership Practicum I (3 credits) NRSE 5503-Executive Leadership Practicum II (3 credits) NRSE 5504-Executive Leadership Practicum III (3 credits) NRSE 5520-Fiscal Management in Nursing Administration (3 credits) NRSE 5530-Health Care Organizations and Law (3 credits) NRSE 5550-Human Resource Management in Health Organizations (3 credits) NRSE 5590-Strategic Planning for Health Care Organizations (3 credits) Nursing, Post-Graduate Nursing Administration, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16879&returnto=3119",
        "document_content": "General Information Dr. Lisa Haddad, PhD, RN, Associate Dean of Graduate Programs 207 Roy S. Nicks Hall Box 70629 (423)439-5626 Email: HaddadL@etsu.edu Dr. Bernita Armstrong, DNP, APN-BC, MN, DNP Program Director Roy S. Nicks Hall Box 70629 (423) 439-5892 e-mail: armstrongb@etsu.edu Dr. Ernest Maupin, Graduate Coordinator 200Roy S. Nicks Hall Box 70629 (423) 439-4504 e-mail: maupine@etsu.edu The Post-Graduate Psychiatric Mental Health Nurse Practitioner concentration offers a Post-Masters certificate for nurses who have completed a Master of Science in Nursing degree. This customized special studies program provides education and clinical training in the PMHNP role. Upon completion of the program, graduates are eligible for the national certification examination. Prospective students must submit a completed application to the School of Graduate Studies which includes official transcripts from all previous undergraduate and graduate coursework, a completed personal essay, a vitae/résumé, and three (3) professional letters of recommendation. GRE reports are not required. Criteria for admission includes: A Master of Science in Nursing (M.S.N.) from a program accredited by the National League for Nursing Accrediting Commission (NLNAC) or the Commission on Collegiate Nursing Education (CCNE); A “B” average (3.0 on a 4.0 scale) in the nursing major; and Licensure in the United States as a registered nurse and eligibility for licensure in Tennessee or compact state. Admission to the post-masters certificate program will be accomplished in the same manner as for the masters nursing degree program. A minimum of twenty-four(24) credits is required for the certificate in Advanced Nursing Practice. For application terms and deadlines please refer to the College of Nursing website. Progression Policy Students in graduate nursing programs must meet the requirements of the School of Graduate Studies to remain in good standing. An overall grade point average (GPA) of 3.0 (B) or better must be maintained. In addition, a nursing student must achieve a “B” or better in every graduate nursing course. Policies of the School of Graduate Studies for progression will apply. Students who receive less than a “B” in a course will have one opportunity to repeat the course. If a students cumulative grade point average falls below 3.0, she/he will be placed on academic probation the following semester. If the student does not achieve a 3.0 cumulative grade point average at the conclusion of one probationary semester, the Dean of the School of Graduate Studies and the Associate DeanGraduate Programs in the College of Nursing will determine if the student should be dismissed from graduate study or continued on academic probation. No student will be allowed more than two probationary semesters, whether consecutive or cumulative. At the end of a second probationary semester, a student whose cumulative grade point average is still below 3.0 will be dismissed from graduate study. Students whose performance results in a GPA so far below 3.0 as to make it mathematically impossible to attain an overall GPA of 3.0 after one semester may be subject to dismissal without a probationary term. An incomplete grade (“I”) indicates that the student was passing the course at the end of the semester, but due to circumstances beyond the students control, was unable to complete the course work for which the “I” is assigned. The “I” grade cannot be used to allow a student to do additional work to raise a deficient grade or to repeat a course. An “I” grade must be removed no later than one calendar year from the time the grade is awarded. Students with more than one “I” grade cannot progress in the program. Time extension requests for removal of an “I” grade must be submitted to and approved by the Dean of the School of Graduate Studies before the allotted time expires. An “I” grade not removed under the guidelines in the Graduate Catalog will be converted to an “F.” Students may have grades of “WF” in no more than one semester within an academic year. Students must maintain an unencumbered registered nurse license in all states where they are currently licensed throughout the duration of the graduate program and in the state(s) where they fulfill clinical course requirements. If at any time during enrollment in the graduate program a students nursing license becomes encumbered, is suspended, or revoked, the student must immediately report this to the Associate DeanGraduate Programs in the College of Nursing. If a students registered nurse license is suspended or revoked, or if a student fails to report any changes in licensure status to the Associate Deanof Graduate Programs, the student will be administratively withdrawn from the graduate program. A students ability to continue enrollment in the graduate program with an encumbered license will be reviewed on an individual basis considering the restriction/limitations placed on the students practice as a registered nurse by the board of nursing in the state issuing the encumbered license. Grade Scale: A=93-100; B=84-92; C=75-83; F=less than 75.Grades maybe rounded at the discretion of the faculty. The student is referred to the Graduate Catalog for more detailed progression information. Post-Graduate Psychiatric Mental Health Nurse Practitioner, Graduate Certificate Requirements: 24 credits Required Courses 24 credits TOTAL 24 credits Required Courses: 24 credits NRSE 5303-Psychopharmacology (3 credits) NRSE 5404-Advanced Family Psychiatric Nursing Care I (3 credits) NRSE 5405-Advanced Family Psychiatric Nursing Care Practicum I (3 credits) NRSE 5408-Advanced Family Psychiatric Nursing Care II (3 credits) NRSE 5409-Advanced Family Psychiatric Nursing Care Practicum II (3 credits) NRSE 5410-Interpersonal Treatment Modalities for Advanced Practice Nurse (3 credits) NRSE 5411-Interpersonal Treatment Modalities Practicum (3 credits) NRSE 6950-Internship in Advanced Nursing Practice (3 credits) Nursing, Post-Graduate Psychiatric Mental Health Nurse Practitioner, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16939&returnto=3119",
        "document_content": "General Program Information Walid Alali, Ph.D. College of Public Health Department of Biostatistics and Epidemiology Lamb Hall 349 Email: alaliw@etsu.edu Phone:423-439-4438 The One Health and Climate Studies Graduate Certificate is a 13-credit100% online program housed bythe College of Public Health andCollege of Arts and Sciences. This graduate certificate will provide students with a comprehensive understanding of the interplay between environmental shifts and health outcomes at the human-animal interface, enabling them to develop innovative strategies to address complex health systems, advocate for evidence-based policies, and lead efforts that bridge the gap between health and sustainability. By fostering cross-disciplinary education and training, this program empowers future public health leaders to address the urgent intersection of climate and health, ensuring their readiness to confront evolving health challenges in an increasingly dynamic world. Admission Requirements In addition to the admissions criteria set by the ETSU Graduate School, the following will be required: Resume or curriculum vitae; A virtual interview. Factors considered in the admission decision include the applicants educational goalsand demonstrated ability to succeed in the program. Articulation Agreement A student who completes the Graduate Certificate in One Health and Climate Studies and subsequently are admitted into the M.P.H., M.H.A., M.A. in Appalachian Studies, orM.S. in Geosciences may apply creditstoward the degree program of study with approval of the degree graduate coordinator and the School of Graduate Studies.All transfer credit, however, must meet GPA requirements and be within matriculation limits (six-years for a masters degree). One Health and Climate Studies, Graduate Certificate Requirements: 13 credits Required Courses 13 credits TOTAL 13 credits Required Courses: 13 credits EPID 5450-Principles of One Health (3 credits) ENVH 5100-Environmental Health Practice I (3 credits) APST 5210-Environment and Sustainability in Appalachia (3 credits) GEOS 5300-Topics in Geospatial Analysis (3 credits) EPID 5961-One Health and Climate Studies Capstone (1 credit) One Health and Climate Studies, Graduate Certificate"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16864&returnto=3119",
        "document_content": "General Program Information Hadii M. Mamudu, PhD, MPA, Associate Professor and Public Health Certificate Coordinator College of Public Health Lamb Hall 159 Box 70264 (423) 439-4484 Email: mamudu@etsu.edu The Graduate Certificate in Public Health is a 16-creditprogram that provides training in the foundations of public health, including health management and policy, social and behavioral sciences, epidemiology, and statistical analysis. The program facilitates professional skill development of working professionals while meeting the public health training needs of students in graduate or professional degree programs.The certificate is available on campus and fully online. Admission Requirements Application materials that must be submitted to the School of Graduate Studies include: A complete application form; An essay (<300 words) articulating the students goals and why the certificate will be useful in achieving those goals; Transcripts from all colleges attended; Three (3) letters of recommendation from professional references, and A résumé or CV. Domestic applicants must possess a bachelors degree and a minimum GPA of 2.5 (on a 4.0 scale) at the undergraduate level. International applicants must have a minimum GPA of 3.0 (on a 4.0 scale) at the undergraduate level. If a student is seeking simultaneous admission to the certificate program and another graduate degree program at ETSU, the student must submit two (2) applications. If a student is currently admitted to a degree program at ETSU and later wishes to be considered for admission to the Public Health Graduate Certificate Program, the student must only submit a completed application form indicating an interest in the certificate program and a dual degree form. All applications will be evaluated by the Graduate Program Coordinator. Factors given consideration in the admission decision include the following: grade point average, professional work experience, writing ability, demonstrated interest in public health and references. Applicants are encouraged to address their related accomplishments and goals in the essay and résumé. First preference for admission will be given to candidates who meet all criteria and file a completed application no later than sixty (60) days prior to the beginning of the semester in which the student plans to begin the program. Articulation Agreement Students who have completed the Public Health Graduate Certificate and subsequently are admitted into the MPH may have up to sixteen (16) of the certificate credits applied toward the degree program of study as long as the courses fall within the matriculation limits and a grade of B (3.0) or better was earned for the course. Public Health, Graduate Certificate Requirements: 16 credits Required Courses 16 credits TOTAL 16 credits Required Courses: 16 credits COBH 5250-Community-Based Methods in Public Health (4 credits) EPID 5100-Analytic Methods in Public Health (4 credits) HSMP 5040-Health Systems, Regulations, and Policies (4 credits) HSMP 5200-Health Leadership & Management (4 credits) Public Health, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17783&returnto=3119",
        "document_content": "Department of Sociology & Anthropology223 Rogers-Stout HallP.O. Box 70644(423) 439-5016Web address:https://www.etsu.edu/cas/sociology-anthropology/Trena Paulus, Graduate Coordinator223 Rogers-Stout Hall(423) 439-6649e-mail:paulust@etsu.eduLeslie McCallister, Ph.D., Department Chair223C Rogers-Stout HallP.O. Box 70644(423) 439-4998e-mail:mccallis@etsu.eduThe Graduate Certificate in Qualitative Research Methods is intended for current graduate students, faculty, and other professionals. It provides training in the foundations of qualitative research design, data collection, analysis, interpretation, writing, and integrating the latest research technologies. The certificate takes an interdisciplinary approach and emphasizes rigorous empirical study design to answer research questions in the social sciences and health sciences.Admission RequirementsStudents must meet the admission requirements established by the Graduate School. Qualitative Research Methods, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17783&returnto=3119",
        "document_content": "Students must meet the admission requirements established by the Graduate School. Qualitative Research Methods, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17783&returnto=3119",
        "document_content": "Qualitative Research Methods, Graduate Certificate Requirements: 12 credits Foundations Course 3 credits Digital Qualitative Research Methods Course 3 credits Advisor Approved Electives 6 credits TOTAL 12 credits Foundations: 3 credits Choose one of the following: ANTH 5627-Ethnographic Methods (3 credits) ELPA 7812-Qualitative Research (3 credits) (For doctoral students only) NRSE 6040-Qualitative Methods in Nursing Research (3 credits) SOCI 5230-Qualitative Research Methods (3 credits) Digital Qualitative Research Methods: 3 credits Choose one of the following: SOCI 5260-Digital Qualitative Research Tools (3 credits) SOCI 5544-Qualitative Social Media Analysis (3 credits) Advisor Approved Electives: 6 credits Choose two of the following non-repeated courses: ANTH 5627-Ethnographic Methods (3 credits) APST 5690-Appalachian Community Engagement (3 credits) COBH 6220-Advanced Qualitative Methods in Community Health Research (3 credits) COMM 5300-Qualitative Research in Communication (3 credits) ELPA 7812-Qualitative Research (3 credits) (For doctoral students only) ELPA 7814-Advanced Qualitative Research (3 credits) (For doctoral students only) NRSE 6040-Qualitative Methods in Nursing Research (3 credits) NRSE 6045-Advanced Qualitative Data Analysis in Nursing Research (3 credits) RTVF 5100-Documentary Research and Production (3 credits) SOCI 5057-Applied Sociology (3 credits) SOCI 5260-Digital Qualitative Research Tools (3 credits) SOCI 5320-Introduction to Evaluation (3 credits) SOCI 5544-Qualitative Social Media Analysis (3 credits) Qualitative Research Methods, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17782&returnto=3119",
        "document_content": "Department of Curriculum and InstructionBox 70684Phone: 423-439-7595Fax: 423-439-8362e-mail:cuai@etsu.eduRenee Rice Moran, Ph.D., Program Coordinator402 Warf-Pickel HallBox 70684(423) 439-7599e-mail:ricemoran@etsu.eduNatalia Ward, Ph.D., Program Coordinator409D Warf-Pickel HallBox 70684(423) 439-7052e-mail:wardna1@etsu.eduThe graduate certificate in reading education is designed to provide the necessary educational experiences for persons who are either preparing to or are already involved in working toward enhancing the reading, writing, and oral language competencies of children and adults. Students are prepared to assume leadership roles in reading education by serving as special reading teachers, clinicians, diagnosticians, program coordinators, reading specialists, literacy coaches, and reading supervisors.This is not an initial teaching licensure program. Persons seeking an initial endorsement license to teach in Tennessee should enter one of the initial licensure programs. Students seeking the additional license or endorsement must meet all state requirements as outlined in the current Tennessee policy.The Office of Educator Preparation can only recommend candidates for the reading specialist endorsement after the candidates has had at least two years of experience as a licensed teacher (TNBOE 5.505) in addition to satisfactory completion of state licensure examinations.Admission RequirementsStudents must meet the Graduate School admission requirements.Articulation AgreementA student who completes the Graduate Certificate, Reading Specialist P-12 and later wishes to pursue the M.Ed. in Reading may transfer all certificate credits into the masters degree with approval of the degree graduate coordinators and the Graduate School. All transfer credit, however, must meet GPA requirements and must be within the six-year matriculation limits. Reading Specialist P-12, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17782&returnto=3119",
        "document_content": "Students must meet the Graduate School admission requirements.Articulation AgreementA student who completes the Graduate Certificate, Reading Specialist P-12 and later wishes to pursue the M.Ed. in Reading may transfer all certificate credits into the masters degree with approval of the degree graduate coordinators and the Graduate School. All transfer credit, however, must meet GPA requirements and must be within the six-year matriculation limits. Reading Specialist P-12, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17782&returnto=3119",
        "document_content": "A student who completes the Graduate Certificate, Reading Specialist P-12 and later wishes to pursue the M.Ed. in Reading may transfer all certificate credits into the masters degree with approval of the degree graduate coordinators and the Graduate School. All transfer credit, however, must meet GPA requirements and must be within the six-year matriculation limits. Reading Specialist P-12, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=17782&returnto=3119",
        "document_content": "Reading Specialist P-12, Graduate Certificate Requirements: 18 credits Required Courses 18 credits Total 18 credits Required Courses: 18 credits READ 5110-History of Reading Research, Policy, & Legislation (3 credits) READ 5120-Advanced Teaching of Reading and Writing (3 credits) READ 5231-Advanced Assessment Procedures in Literacy Education (3 credits) READ 5241-Practicum in Literacy Teaching & Leading (1-3 credits) (take for 3 credits) READ 5871-Advanced Practicum in Literacy Education (1-3 credits) (take for 3 credits) READ 5950-Action Research in Literacy Education (3 credits) Reading Specialist P-12, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16922&returnto=3119",
        "document_content": "General Program Information Robert Pack, PhD, MPH, Professor, Associate Dean for Academic Affairs in the College of Public Health Graduate Coordinator Office Location: 914 W. Maple Street, room 210 Box 70623 (423) 439-4243 Email: packr@etsu.edu Addictionrecovery support services positively impact individuals, families, and communities. Implementation of recovery support servicescurrently outpaces thescience of the field. More rigorous research is neededtoinform the content and practice of effective recovery support sercies. This 12-hour certificate will include two existing courses in social work, two non-credit bearing workshops on the responsible conduct of clinical/health services research, and two new interprofessional courses designed to enhance student skills in research methods for addiction and recovery research. The certificate isdesigned for graduate students, membersof regional health systems, addiction treatment facilities, and othercommunity-based organizations (CBOs) that are interested in conducting or participating in recovery research. Admission Requirements The criteria for admission to the Graduate Certificate in Recovery Research includes: 1) A baccalaureate degree; and 2) A minimum grade point average (GPA) of 2.5 on a 4.0 scale for domestic students and 3.0 on a 4.0 scale for international students. Application materials that must be submitted to the School of Graduate Studies include an application, essay, official transcripts from all colleges attended, names of three (3) professional references, and a résumé or CV. If a student is seeking simultaneous admission to the certificate program and another graduate degree program at ETSU, the student must submit two (2) applications. If a student is currently admitted to a degree program at ETSU and later wishes to be considered for admission to the Graduate Certificate in Recovery Research program, the student must only submit a completed application form indicating an interest in the certificate program and a dual degree form. All applications will be evaluated by the GraduateProgram Coordinator. Factors given consideration in the admission decision include: grade point average; career and educational levels; references; evidence of capacity to engage in interdisciplinary recovery-focused work; and demonstrated interest in and/or history of research in the prevention or treatment of substance use disorder and/or related topics (e.g., HIV). Applicants are encouraged to address their related accomplishments, interests, and goals in the essay and résumé/CV. First preference for admission will be given to candidates who meet all criteria and file a completed application no later than sixty (60) days prior to the beginning of the semester in which the student plans to begin the program. Selection for participation will be based on: a) appropriate career and educational levels, including affiliation with partnering academic or community organizations;b) evidence of capacity to engage in interdisciplinary recovery-focused work; and c) a strong interest in and/or history of research in the prevention or treatment of SUD and/or related topics (e.g., HCV or HIV). Recovery Research: 12 credits Required Courses 12 credits Required Non-Course Workshops TOTAL 12 credits Required Courses: 12 credits SOWK 5369-The Science of Addiction for Behavioral Health Professionals (3 credits) * SOWK 5370-Cultural Humility in Addiction Treatment and Prevention (3 credits) * COBH 5371-Methods in Interdisciplinary Addiction and Recovery Research (3 credits) COBH 5372-Advanced Methods in Interdisciplinary Addiction and Recovery Research (3 credits) Workshop Part 1: Responsible Conduct of Clinical/Health Services Research Workshop Workshop Part 2: Responsible Conduct of Clinical/Health Services Research Workshop Notes: *Prerequisite will be waived for students in the Recovery Research, Certificate. Contact instructor/program coordinatorfor permit. Recovery Research, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16817&returnto=3119",
        "document_content": "General Program Information Bethesda OConnell, Dr.PH., M.P.H., C.H.E.S., Assistant Professor, Department of Community and Behavioral Health Office Location: Lamb Hall 452 Box 70674 (423) 439-4816 e-mail: oconnell@etsu.edu The Rural Health Graduate Certificate Program is a 15-credit-hour program designed to provide students with knowledge and skills needed to assess, plan, implement, and evaluate rural health programs and services. Admission to the Program The criteria for admission to the Rural Health Graduate Certificate Program include: A bachelors degree from a regionally accredited institution. A minimum undergraduate grade point average of 2.5 on a 4.0 scale. Application materials which must be submitted to the School of Graduate Studies include: an application; three (3) letters of recommendation; and transcripts from all colleges attended. All applications will be evaluated by an admission committee. Articulation Agreement Students who have completed the Rural Health Graduate Certificate and subsequently are admitted into the MPH with a concentration in Community Health may have up to fifteen (15) of the certificate credits applied toward the degree program of study as long as the courses fall within the matriculation limits. Rural Health, Graduate Certificate Requirements: 15 credits Required Courses 15 credits TOTAL 15 credits Grade Requirement: Certificate students must obtain a grade of “C” or higher in all required courses. Required Courses: 15 credits COBH 5020-Foundations of Rural Health (3 credits) COBH 5060-Seminar in Rural Health (1 credit) EPID 5100-Analytic Methods in Public Health (4 credits) COBH 5250-Community-Based Methods in Public Health (4 credits) COBH 5377-Health Communication (3 credits) Rural Public Health, Graduate Certificate"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16818&returnto=3119",
        "document_content": "General Program Information Renee C. Lyons, M.L.S., Graduate Coordinator 414Warf-Pickel Box 70684 (423) 439-7845 e-mail: lyonsrc@etsu.edu The School Library Professional certificate offers qualified candidateswho have a masters degree from an accredited institution andhold a valid Tennessee teacher license to take 24 credits of approved classes to meet the current school licensure requirements for Tennessee endorsement School Library Specialist #473. Because courses are arranged sequentially and may only be offered once each year, students would complete all classes successfully in the previous term before advancing to the next term. Faculty: Renee Lyons School Library Professional, Graduate Certificate Requirements: 24 credits Required Courses 24 credits TOTAL 24 credits Required Courses: 24 credits MEDA 5000-History and Philosophy of Librarianship (3 credits) MEDA 5628-Childrens Materials (3 credits) MEDA 5635-Reference Materials (3 credits) MEDA 5637-Young Adult Materials (3 credits) MEDA 5710-School Librarianship Collection Development and Program Management (3 credits) MEDA 5720-Cataloging and Classification (3 credits) MEDA 5926-School Librarianship Practicum I (3 credits) MEDA 5929-School Librarianship Practicum II (3 credits) Note: At the completion of the coursework, students follow the current state requirements for Praxis examinationsand apply for add-on status to their current teaching licensure. School Library Professional, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16858&returnto=3119",
        "document_content": "General Program Information John J. Wheeler, Ph.D., Graduate Coordinator,Interim Department Chair 510 Warf-Pickel Hall Box70547 (423) 439-4196 e-mail: wheelerjj@etsu.edu The Special Education Program offers an Early Childhood Special Education Certificate Program. The program provides advanced coursework directed at evidenced-based practices for working with young children with and at risk for disabilities. For current teachers, this certificate program can lead to an additional teacher licensure in Early Childhood Special Education. Admission to the Program In addition to the requirements of the School of Graduate Studies: A minimum undergraduate GPA of 3.0 on a 4.0 scale. Submission of a 2-page essay outlining past experience with individuals with disabilities and goals for acquiring a certificate in Special Education. Articulation Agreement A student who applies and is accepted into the masters program in Special Education witha concentration in Special Education, Early Childhood Special Education, or Advanced Studies in Special Education, may apply up to eighteen (18) credits from the Special Education: Early Childhood Special Education Certificate Program as the certificate programs coursework aligns with the masters degree program. Special Education: Early Childhood Special Education, Graduate Certificate Requirements: 18 credits Required Courses 18 credits TOTAL 18 credits Required Courses: 18 credits SPED 5020-Instructional Practices for Exceptional Needs, K-3 (3 credits) SPED 5030-Instructional Practices for Preschoolers (3 credits) SPED 5040-Intervention Practices with Infants, Toddlers, and Families (3 credits) SPED 5401-Positive Behavior Supports and Classroom Management (3 credits) SPED 5445-Advanced Applications of Assistive Technology and Medical Aspects (3 credits) SPED 5755-Assessment and Programming for Exceptional Learning Needs (3 credits) Note: Students who have taken undergraduate equivalencies of the above courses may substitute such courses with coursework approved by the Graduate Coordinator and the students advisor of record. Students who have taken graduate equivalencies of the above courses may transfer in 9 credits that are approved by the Graduate Coordinator and the students advisor of record. Special Education: Early Childhood Special Education, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16857&returnto=3119",
        "document_content": "General Program Information John J. Wheeler, Ph.D., Graduate Coordinator,Interim Department Chair 510 Warf-Pickel Hall Box70547 (423) 439-4196 e-mail: wheelerjj@etsu.edu The Special Education Program offers a Certificate in Special Education: High Incidence Disabilities. The program provides advanced coursework directed at evidenced-based instructional practices for K-12 students with high incidence disabilities (e.g., learning disabilities, attention deficit disorders, mild behavior disorders, mild intellectual disorders). For current teachers, this certificate program can lead to an additional teacher licensure in K-8 and6-12 Interventionist. Admission to the Program In addition to the requirements of the School of Graduate Studies: A minimum undergraduate GPA of 3.0 on a 4.0 scale. Submission of a 2-page essay outlining past experience with individuals with disabilities and goals for acquiring a certificate in Special Education. Articulation Agreement A student who applies and is accepted into the masters program in Special Education witha concentration in Special Education, Early Childhood Special Education, or Advanced Studies in Special Education, may apply up to eighteen (18) credits from the Special Education: High Incidence Disabilities Certificate Program as the certificate programs coursework aligns with the masters degree program. Special Education: High Incidence Disabilities, Graduate Certificate Requirements: 18 credits Required Courses 18 credits TOTAL 18 credits Required Courses: 18 credits SPED 5401-Positive Behavior Supports and Classroom Management (3 credits) SPED 5445-Advanced Applications of Assistive Technology and Medical Aspects (3 credits) SPED 5467-Teaching Math to Students with Mild/Moderate Exceptional Learning Needs (3 credits) SPED 5497-Teaching and Learning Strategies for Exceptional Learning Needs (3 credits) SPED 5755-Assessment and Programming for Exceptional Learning Needs (3 credits) SPED 5757-Evidence-Based Instruction in Reading and Language Arts (3 credits) Note: Students who have taken undergraduate equivalencies of the above courses may substitute such courses with coursework approved by the Graduate Coordinator and the students advisor of record. Students who have taken graduate equivalencies of the above courses may transfer in nine (9) credits that are approved by the Graduate Coordinator and the students advisor of record. Special Education: High Incidence Disabilities, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16856&returnto=3119",
        "document_content": "General Program Information John J. Wheeler, Ph.D., Graduate Coordinator,Interim Department Chair 510 Warf-Pickel Hall Box70547 (423) 439-4196 e-mail: wheelerjj@etsu.edu The Special Education Program offers a Certificate in Special Education: Low Incidence Disabilities. The program provides advanced coursework directed at evidenced-based instructional practices for K-12 students with low incidence disabilities (e.g., intellectual disorders, autism, multiple disabilities). For current teachers, this certificate program can lead to an additional teacher licensure in Comprehensive Special Education. Admission to the Program In addition to the requirements of the School of Graduate Studies: A minimum undergraduate GPA of 3.0 on a 4.0 scale. Submission of a 2-page essay outlining past experience with individuals with disabilities and goals for acquiring a certificate in Special Education. Articulation Agreement A student who applies and is accepted into the masters program in Special Education witha concentration in Special Education, Early Childhood Special Education, or Advanced Studies in Special Education, may apply up to eighteen (18) credits from the Special Education: Low Incidence Disabilities Certificate Program as the certificate programs coursework aligns with the masters degree program. Up to nine credits may be transferred from the Low Incidence Disabilities Certificate Program to another Special Education certificate program where applicable. Special Education: Low Incidence Disabilities, Graduate Certificate Requirements: 18 credits Required Courses 18 credits TOTAL 18 credits Required Courses: 18 credits SPED 5367-Systematic Instruction for Functional and Academic Programming (3 credits) SPED 5401-Positive Behavior Supports and Classroom Management (3 credits) SPED 5445-Advanced Applications of Assistive Technology and Medical Aspects (3 credits) SPED 5587-Access to the General Curriculum for Students with Significant Disabilities (3 credits) SPED 5755-Assessment and Programming for Exceptional Learning Needs (3 credits) SPED 5767-Advanced Strategies for Behavioral Interventions (3 credits) Note: Students who have taken undergraduate equivalencies of the above courses may substitute such courses with coursework approved by the Graduate Coordinator and the students advisor of record. Students who have taken graduate equivalencies of the above courses may transfer in nine (9) credits that are approved by the Graduate Coordinator and the students advisor of record. Special Education: Low Incidence Disabilities, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16890&returnto=3119",
        "document_content": "General Program Information Michelle L. Lee, Ph.D., R.D., Graduate Coordinator, Department Chair 100 Hutcheson Hall Box 70260 (423) 439-7524 e-mail: leeml2@etsu.edu The Sport Nutrition Certificate is a 15-credit fully online program of study designed for professionals and graduate students who are interested in increasing their knowledge of sport nutrition. Since sport nutrition is not a federally regulated occupation, each state is free to set their own certification and licensing standards. This certificate is not associated with the requirements to qualify students to take the national registered dietitian-credentialing exam. Admission Requirements In addition to the School of Graduate Studies requirements, the following are required a) Bachelor of Science (BS) degree in nutrition, dietetics, exercise science, exercise physiology, kinesiology, athletic training, physical therapy or closely-related field or a) Registered Dietitian Nutritionist (RDN), b) Registered Dietitian (RD), c) graduate student currently enrolled in a dietetic internship/supervised practice accredited by Accreditation Council for Education in Nutrition and Dietetics (ACEND) of the Academy of Nutrition and Dietetics (AND). At least 3 credits in Anatomy and Physiology or Exercise Physiology At least 3 credits in Principles of Nutrition Science or Introduction to Nutrition Science Resume 3.0 or above cumulative GPA on undergraduate coursework 3 letters of recommendation Program Requirements The Sport Nutrition Certificate will be awarded only to students who have been officially admitted to the program and successfully completed the 15-credits of approved coursework. Graduate credits from another institution cannot be transferred to the Certificate in Sport Nutrition program. All courses in the certificate must be completed at ETSU. Sport Nutrition, Graduate Certificate Requirements: 15 credits Required Courses 15 credits TOTAL 15 credits Required Courses: 15 credits NTFD 5150-Introduction to Sport Nutrition (3 credits) NTFD 5250-Nutrition and Exercise in Weight Management (3 credits) NTFD 5255-Nutraceuticals and Dietary Supplements for Health and Performance (3 credits) NTFD 5350-Advanced Sport Nutrition for Athletic Performance (3 credits) NTFD 5550-Current Trends in Sport Nutrition (3 credits) Sport Nutrition, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16875&returnto=3119",
        "document_content": "General Program Information Laura Robertson, Ph.D., Assistant Professor, Graduate Program Coordinator 402 Warf Pickel Hall PO Box 70684 (423) 439-7678 email: robertle@etsu.edu The certificate aligns closely with the Masters in Education in Curriculum & Instruction. A student who wishes to pursue an ETSU masters degree in education concurrently with the certificate must also apply and be admitted to the degree program. All credits must meet GPA requirements and must be within the matriculation limit. Admission Requirements In addition to the requirements of the School of Graduate Studies: A minimum undergraduate GPA of 3.0 on a 4.0 scale. Submission of a 2-page essay outlining past experience with STEM education and goals beyond achieving the certificate in STEM PreK-12 Education. Articulation Agreement Students who have completed the STEM K-12 EducationGraduate Certificate and subsequently are admitted to the M.Ed. in Curriculum and Instruction may applyup to nine (9) credits from the STEM K-12 Education Certificate Program. STEM K-12 Education, Graduate Certificate Requirements: 9 credits Required Courses 9 credits TOTAL 9 credits Required Courses: 9 credits SCED 5600-STEM Theory and Pedagogy (3 credits) SCED 5620-Bridging STEM in Education and Business (3 credits) SCED 5630-Integrated STEM Curriculum Development (3 credits) STEM K-12 Education, Graduate Certificate"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16826&returnto=3119",
        "document_content": "General Program Information Amber Kinser, Ph.D., Chair,Graduate Coordinator 217Campus Center Building Box 70667 (423) 439-7676 e-mail: kinsera@etsu.edu Faculty: Delanna Reed. Graduate Certificate in Storytelling The graduate certificate is a post baccalaureate sequence containing core masters level coursework in storytelling performance skills and practice. The certificate prepares students to pursue professional storytelling as a career or to apply storytelling in professions such as business, medicine, counseling, teaching, law, ministry, etc. Admission Completed application form with essay; one official transcript from each undergraduate and graduate institution attended, three letters of recommendation from academic or professional mentors or associates. Storytelling, Graduate Certificate Requirements: 21 credits Required Courses 15 credits Advisor Approved Electives 6 credits TOTAL 21 credits Required Courses: 15 credits STOR 5140-Foundations of Storytelling Performance (3 credits) STOR 5230-Advanced Storytelling Performance (3 credits) STOR 5890-History of Performance Traditions (3 credits) STOR 5820-Vocal Training for Professionals (3 credits) STOR 5241-Practicum: Storytelling (1-3 credits) Advisor Approved Electives: 6 credits Approved electives from Storytelling Program catalogs or related electives with approval of advisor. Storytelling, Graduate Certificate*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16935&returnto=3119",
        "document_content": "General Program Information Susan Epps, Ed.D., Program Coordinator 512Warf-Pickel Hall Box 70550 (423) 439-7609 e-mail: epps@etsu.edu This certificateprovidesprofessional development forstudent life professionals seeking continuing education in the student life field. This program is designed to increaseknowledge of student development and leadership principles andhow they apply to the various areas of the institution as well asworking with students and other members of the university community. Program Admission Requirements Students must meet the Graduate School admission requirements. Articulation Agreements Students who have completed the Student Affairs Graduate Certificate and subsequently are admitted into the M.Ed. in Educational Leadership (Higher Education concentration) may have up to twelve (12)of the certificate credits applied toward the degree program of study. Students who have completed the Student Affairs Graduate Certificate and subsequently are admitted into the Ed.D.in Educational Leadership (Higher Education concentration) may have up to nine (9)of the certificate credits applied toward the degree program of study. Student Affairs, Graduate Certificate Requirements: 12 credits Required Course 3 credits Advisor Approved Electives 9 credits Total 12 credits Required Course: 3 credits ELPA 5722-Student Development and the College Environment (3 credits) Advisor Approved Electives: 9 credits Choose 9 credits of electives in consultation with an advisor.Most of the electives are ELPA courses, and students will work with the program coordinator to determine what courses are most appropriate for their current or future professional goals/needs. Student Affairs, Graduate Certificate (Online)*"
    },
    {
        "document_title": "Certificate",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=57&poid=16829&returnto=3119",
        "document_content": "General Program Information Theresa McGarry, Ph.D., Coordinator 312 Burleson Hall Box 70683 (423) 439-6680 email: mcgarry@etsu.edu Daniel Westover, Ph.D., Department Chair 103ABurleson Hall Box 70683 (423) 439-6626 e-mail: westover@etsu.edu Website: www.etsu.edu/cas/litlang/tesol Faculty: Yousif Elhindi; Theresa McGarry; Martha Michieka. The department of English offers a graduate certificate in TESOL that provides knowledge and skills necessary to teach English as a second language in a variety of settings beyond the public schools. The course enables students to understand the process of learning a second language, design and implement English courses that meet the needs of English learners in adult education programs and institutes of higher learning, develop a view of themselves as professionals in the specialized field of teaching English as a second language, and understand the basis of continuing professional development in this field. Program Admission Requirements A student applying to the TESOL certificate program should have the following: a bachelors degree with at least 3.0 GPA (on a 4.0 scale) two years of coursework or basic proficiency in a foreign language two letters of recommendation A student who wishes to pursue an M.A. in addition to the certificate also needs to meet the requirements for admission to that program; admission into the certificate program does not entail admission into the M.A. program, even though many of the certificate courses can be applied to the M.A. Curriculum Students must complete a total of 18 credits, of which 15 will result from required courses (listed below) and three from one or more elective courses. A minimum grade of C is required in each course. Teaching English to Speakers of Other Languages, Graduate Certificate Requirements: 18 credits Required Courses 15 credits Advisor Approved Electives 3 credits TOTAL 18 credits Required Courses: 15 credits ENGL 5117-Grammar and Usage (3 credits) ENGL 5150-Sound Systems of English (3 credits) ENGL 5170-Teaching English as a Second Language (3 credits) ENGL 5180-Internship in Teaching English as a Second Language (1-3 credits) ENGL 5190-Second Language Acquisition (3 credits) Advisor Approved Electives: 3 credits Students must complete three credits from the list of courses below; other courses are acceptable if approved by the students advisor. ENGL 5137-Dialectology (3 credits) ENGL 5680-Seminar in Linguistics (3 credits) ENGL 5950-Methods of Research (3 credits) EDFN 5200-Advanced Educational Psychology (3 credits) ECED 5356-Language and Literacy Development of Young Children (3 credits) READ 5190-Linguistics of Reading (3 credits) Teaching English to Speakers of Other Languages, Graduate Certificate*"
    }
]