[
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17187&returnto=3362",
        "document_content": "Purpose: The accelerated bachelors to masters degree program provides high performing ETSU undergraduate students an opportunity to complete both the bachelor and master degrees at an accelerated pace. Participating students can apply as many as 12 credit hours of graduate-level coursework toward both of their degrees. Benefit:Participating students will benefit by accelerated completion of two degrees, reducing time and cost. Programs will benefit by recruiting motivated students who desire such an opportunity. Particularly motivated students with a number of dual-enrollment or advanced placement courses could additionally reduce the time and cost of earning both degrees. Eligibility:ETSU students may apply to the program once they have completed 75 credits in their undergraduate programs, including credits earned from dual enrollment or advanced placement. They must apply and be accepted to the accelerated program (including acceptance into the graduate program) prior to earning the undergraduate degree. Transfer students must have completed at least one year (2 semesters) at ETSU prior to requesting admission to the accelerated program. Minimum GPA:Students must have a minimum ETSU undergraduate GPA of 3.25 to request admission to the program. Individual programs may impose higher GPA requirements. Admissions:Admission to the accelerated program is contingent on meeting requirements of the respective programs and the School of Graduate Studies (SGS). Permission to pursue developing a proposal for the accelerated program will not guarantee admission to the graduate program. Application process: Students meeting the eligibility requirements and wishing to pursue the accelerated program should contact their undergraduate advisor and the graduate program coordinator to schedule a meeting to create a proposal.Once the accelerated program proposal is agreed upon by the student and coordinators, the graduate program coordinator will make a Plan of Graduate Work memo for the students file that contains the following specific information:Plan of study for both degrees that includes:The list of the graduate credits (up to 12) that will apply toward both degrees.The courses that will be taken after matriculating into the masters program.Permission to pursue the program from both coordinators.The rationale for substitution for each graduate course that will be applied toward the undergraduate degree. The rationale can be based on an analysis of course objectives, competencies, or other objective measures.Target dates for graduation. Note that it is expected that most students will earn the bachelor degree en route to the master degree but some programs may require simultaneous awarding of both degrees. This must be specified in the plan.A copy of the plan will be provided to the Dean of the School of Graduate Studies for review.When the student has earned at least 75 undergraduate credits toward the bachelor degree and is otherwise eligible, the student will then seek admission to the School of Graduate Studies using the standard application form, making a note to check the box indicating the intent to apply for the accelerated program.Standard SGS application procedures will be followed. Where a graduate program also requires a specialized application service the student applying for the accelerated program will not be required to use this service and will only use the ETSU application for admission for graduate study.Regular SGS application fees must be paid.In general, students applying for the accelerated program will not be required to take standardized admissions tests, however programs may elect to require a test in some cases. This must be reflected in the Plan of Graduate Work. Acceptance or Denial:Upon review of the submitted materials, the graduate program admissions committee will recommend to the SGS that the Dean make an offer of acceptance or denial to the student. The Deans letter should state that award of the graduate degree will be contingent on meeting the stated accelerated program requirements. Copies of this letter will be sent to the graduate program coordinator and the undergraduate advisor. Modifications:Any modifications to the agreed-upon plan of study will be requested through the same mechanism that the student used when outlining the original request; i.e., both the undergraduate advisor and the graduate coordinator will be involved and the changes will be approved by the Dean of SGS. Student Classification:Students accepted into the Accelerated Bachelors to Masters Degree program will be classified as undergraduate students during the first year in the program and tuition will be billed at the undergraduate rate for all courses. This is the year when they are taking both undergraduate and graduate (up to 12 credits) courses. For all subsequent terms, students will be classified as graduate students and will be billed at the graduate rate for all courses. Graduate Tuition Scholarships and Graduate Assistantships: Students in the accelerated program are not eligible for graduate Tuition Scholarships. Once students are classified as graduate students, they may be considered for graduate assistantships if they are eligible per policy in the GA Handbook.https://www.etsu.edu/gradstud/pdf/gatshandbook.pdf Additional Requirements: Students must receive a grade of B or better in the courses to be applied toward both the bachelor and master degrees.No more than twelve (12) credits of graduate work may be counted towards the requirements of both degrees.If a students cumulative undergraduate and graduate GPA falls below the required program minimum, then he/she will need program and graduate school approval to continue in the accelerated program. Program approval of continuation must be written and copied to the students undergraduate and graduate files.A student who withdraws or is administratively withdrawn from the accelerated program may not subsequently count courses for both degrees; the student may count eligible courses toward one degree only. Matriculation limits:Because of the nature of the Accelerated Bachelors to Masters Program, it is fully expected that the student will meet the timeline specified in the Plan of Graduate Work for completion of both degrees. In a rare instance of significant impediment, a revised plan for completion must be submitted and approved by the graduate program coordinator and the Dean of the School of Graduate Studies. Note that graduate degree matriculation limits will apply and matriculation limits start from the date of the first course taken that will apply toward the masters degree. See “Matriculation Limits” in the graduate catalog. Withdrawal:A student that wishes to withdraw from the accelerated program may do so by notifying the appropriate undergraduate and graduate coordinators in writing, copying the Dean of the SGS. Staff in the School of Graduate Studies will work with the ETSU Office of the Registrar to amend the students records. Formalized articulation:Graduate programs that wish to set up formalized articulated programs will be encouraged to create articulation agreements between the affected bachelors and masters programs. Articulation agreements require the cooperation of the undergraduate and graduate programs and faculty, and must be approved by the College Curriculum Committee(s), College Dean(s), Undergraduate Curriculum Committee, Graduate Council, Academic Council, ETSU President, and the East Tennessee State University Board of Trustees. Accelerated Bachelors to Masters Degree Program"
    },
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17205&returnto=3362",
        "document_content": "Attract and enroll high achieving students to ETSU and GCOP by providing an early admission pathway into the Doctor of Pharmacy (PharmD) program Pharmacy Early Admission Pathway"
    },
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17205&returnto=3362",
        "document_content": "The program provides two pathways of early entry into GCOP High school pathway for high school seniors who will be entering ETSU as freshmenCollege pathway for currently enrolled ETSU students Pharmacy Early Admission Pathway"
    },
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17205&returnto=3362",
        "document_content": "High School Pathway No minimum high school GPA or ACT is required; however, competitive applicants will score in the range of 25 on the ACT and have GPAs around 3.75. Gatton College of Pharmacy recognizes that grades and test scores are only small aspects of applicants overall ability to succeed as a student pharmacist and later excel as a practitioner, and as such encourage students interested in attending the ETSU Gatton College of Pharmacy to apply. College Pathway Current ETSU studentFull-time studentMajority of coursework must be completed at ETSU including all core math and science prerequisites, unless otherwise approved by the GCOP Office of Student AffairsCompetitive applicants will possess ETSU GPA of at least 3.00 (cumulative and math/science)At time of application, shall have completedat least 2 semesters (or be in the process)a minimum of 12 hours of math/science prerequisites (or be in the process) Pharmacy Early Admission Pathway"
    },
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17205&returnto=3362",
        "document_content": "Students accepted into the program are provided with a conditional acceptance to GCOP that allows them to matriculate into the PharmD program without going through the traditional admission process. Final matriculation is conditional upon satisfying all program requirements, including but not limited to the following: Satisfactory completion of all PharmD prerequisites with a minimum grade of CAll prerequisite coursework must be taken at ETSU unless an exception is grantedMaintain continuous enrollment as full-time studentFollow recommended course of study including15 hours per semesterMaintain a cumulative GPA>3.50GPA will be checked each semesterStudents not meeting requirement will be advisedMaintain a GPA>3.25in all math and science courses takenAll GPA calculations shall be made in accordance with ETSU policiesParticipate in select personal/professional development activitiesStudents are expected to be/become active members of the ETSU Pre-pharmacy Student Organization Pharmacy Early Admission Pathway"
    },
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17205&returnto=3362",
        "document_content": "Students Program participants shall be considered members of the GCOP student body upon initial acceptance into the program. As such, participants will be assigned a GCOP student mentor, and have the opportunity to participate in all college activities. Pharmacy Early Admission Pathway"
    },
    {
        "document_title": "Other Programs",
        "document_link": "https://catalog.etsu.edu/preview_program.php?catoid=58&poid=17205&returnto=3362",
        "document_content": "Students may enter GCOP as early as the end of their second year of undergraduate education but could delay entry to complete additional coursework or degree, if desired. Students entering ETSU with AP or dual-enrollment credit hours may be able to shorten the timeframe. Students delaying entry will be required to continually meet academic standards of the program. Pharmacy Early Admission Pathway"
    }
]