[
    {
        "document_title": "Department Chair & Associate Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/brian-bennett.php",
        "document_content": "Name: Brian Bennett, PhD, Title: Department Chair & Associate Professor, Email: bennetbt@etsu.edu, Phone: 423-439-7409 Dr. Brian Bennett joined the ETSU Department of Computing faculty in 2004. He received his B.S. and M.S. degrees in Computer Science from ETSU and his Ph.D. in Computer Information Systems from Nova Southeastern University. He served professionally in various computing-related roles—programmer, information systems data analyst, and database and systems administrator—before moving into his faculty position.⁠ ⁠ Dr. Bennett’s research interests include software engineering, static analysis of programs, AI and machine learning applications, and teaching techniques. He has authored or co-authored 13 journal articles and conference proceedings and presented at seven conferences.⁠"
    },
    {
        "document_title": "Executive Aide 3",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/anica-bowling.php",
        "document_content": "Name: Anica Bowling, Title: Executive Aide 3, Email: bowlinga@etsu.edu, Phone: 423-439-5328 N/A"
    },
    {
        "document_title": "Undergraduate Coordinator & Assistant Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/ghaith-husari.php",
        "document_content": "Name: Ghaith Husari, PhD, Title: Undergraduate Coordinator & Assistant Professor, Email: husari@etsu.edu, Phone: 423-439-6964 N/A"
    },
    {
        "document_title": "Dean & Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/tony-pittarese.php",
        "document_content": "Name: Tony Pittarese, PhD, Title: Dean & Professor, Email: pittares@etsu.edu, Phone: 423-439-5489 N/A"
    },
    {
        "document_title": "Graduate Coordinator & Associate Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/jeff-roach.php",
        "document_content": "Name: Jeff Roach, PhD, Title: Graduate Coordinator & Associate Professor, Email: roachj@etsu.edu, Phone: 423-439-6966 N/A"
    },
    {
        "document_title": "Assistant Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/ahmad-al-doulat.php",
        "document_content": "Name: Ahmad Al Doulat, PhD, Title: Assistant Professor, Email: aldoulat@etsu.edu, Phone: 423-439-6963 Dr. Al Doulat joined the ETSU in the Department of Computing this fall 2021 to serve the Data Analytics program at both undergraduate and graduate levels. Dr. Al Doulat's educational background includes a bachelor’s in Computer Science, a master’s in Computer Science, and a Ph.D. in Software and Information Systems from the University of North Carolina at Charlotte in 2021. His prior academic experience includes services at the University of North Carolina at Charlotte.⁠ ⁠ His research interests lie in the broad area of data science with an emphasis on machine learning, Human-Computer Interaction, Data Analysis, Data Visualization and Storytelling, and Natural Language Processing. During his Ph.D., he worked on a collaboration project between the National Science Foundation and the University of North Carolina at Charlotte. This project develops innovative techniques and applications to automatically discover potential trends and influence factors from big data. In this project, he designed and developed a decision support system to support academic and professional faculty members and advisors understand the complex and heterogeneous student data. This decision support system wins an award from the NSF Innovation Corps and UNC Charlotte's Innovation and Entrepreneurship Center.⁠"
    },
    {
        "document_title": "Professor of Practice",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/michael-austin.php",
        "document_content": "Name: Michael Austin, Title: Professor of Practice, Email: austinmw@etsu.edu, Phone: 423-439-6405 Mr. Michael Austin joined the ETSU Department of Computing faculty as a Professor of Practice in 2021. He received his B.S. in Computer Science from Virginia Tech. Mr. Austin worked 30 years at Eastman Chemical where he retired as the Director of Digital Operations.⁠ ⁠ Mr. Austin spent 4 years managing Eastman’s Cyber Security and Risk Management programs. He led the creation of a risk management framework including; cyber security, business continuity, regulatory compliance, and privacy. During his time in the role he focused on network segmentation, intellectual property protection, intrusion detection, incident response, and rights management.⁠"
    },
    {
        "document_title": "Assistant Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/biju-bajracharya.php",
        "document_content": "Name: Biju Bajracharya, PhD, Title: Assistant Professor, Email: bajracharya@etsu.edu, Phone: 423-439-6961 Dr. Bajracharya, better known for his IT skills in networking/system/database administrations, programming, cybersecurity, data analytics, and IoT, joined the ETSU in the Department of computing this fall 2021 to serve the Cybersecurity programs at both undergraduate and graduate levels. Dr. Bajracharya's educational background includes a bachelor’s in mechanical engineering, a master’s in business studies, an MS in Engineering Technology, and a Ph.D. in Computational Science from the University of Southern Mississippi in 2014. He holds a number of active IT certifications from Cisco, Microsoft, VMware, CompTIA, and EC-Council.⁠ ⁠ His prior academic experience includes services at Ball State University, Lock Haven University of Pennsylvania, and the University of Southern Mississippi. His most accomplished research work was developing and designing an automated photocatalytic chamber for measuring and monitoring photocatalytic chemical reactions, and the automated prototype design of Micro Fouling measurement for the Paint coating simulating underwater submarine movement in the laboratory conditions and their computational analysis. His current research interests and currently working in the field of cyber-physical systems, cybersecurity, Internet of Things, data-compression, Computer Networking, and data analytics.⁠"
    },
    {
        "document_title": "Lecturer, BlueSky TN Institute",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/rachel-bakaletz.php",
        "document_content": "Name: Rachel Bakaletz, Title: Lecturer, BlueSky TN Institute, Email: bakaletz@etsu.edu, Phone: 423-439-6953 Rachel Bakaletz grew up in Anderson County, Tennessee, which is about 20 minutes north of Knoxville. She graduated with a bachelor’s degree in computer science from ETSU in May 2020."
    },
    {
        "document_title": "Site Director & Senior Lecturer, BlueSky TN Institute",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/mathew-desjardins.php",
        "document_content": "Name: Mathew Desjardins, Title: Site Director & Senior Lecturer, BlueSky TN Institute, Email: desjardinsm@etsu.edu, Phone: 423-439-6951 Professor Mathew Desjardins brings an innovative, interdisciplinary perspective to East Tennessee State’s Department of Computing. Following an extensive career in management and technology consulting, Prof. Desjardins returned to ETSU to complete his B.S. and M.S. degrees in Computer Science. Beyond his teaching capacity, Desjardins has spearheaded several university-level and departmental-level initiatives and committees, including chairing both the college and department-level curriculum committees while also leading recruitment, advisement, and orientation efforts through academic outreach initiatives.⁠ ⁠ Beginning Jan 1, 2022, Desjardins began serving as the Interim BlueSky Institute Site Director. BlueSky (www.blueskytn.com) will be based in Chattanooga and is a groundbreaking workforce development partnership between BlueCross BlueShield of Tennessee (BCBST) and East Tennessee State University (ETSU). It is designed to meet a critical business need for BCBST by developing local technology talent the company needs to serve its customers, business partners, and communities. Desjardins’ experience with student transition into college, advising, and Computing coursework will lead him to successfully serve as the Site Director for BlueSky."
    },
    {
        "document_title": "Assistant Professor & Director of Instructional Design",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/chelsie-dubay.php",
        "document_content": "Name: Chelsie Dubay, EdD, Title: Assistant Professor & Director of Instructional Design, Email: dubayc@etsu.edu, Phone: 423-439-6959 N/A"
    },
    {
        "document_title": "Professor of Practice",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/jeff-fraley.php",
        "document_content": "Name: Jeff Fraley, Title: Professor of Practice, Email: fraleyj@etsu.edu, Phone: 423-439-6849 Jeff Fraley has 33 years of professional information systems leadership experience, and served in an IT Director position at Eastman Chemical.⁠ ⁠ In his professional experience he was responsible for managing the information resources for a global organization to ensure that systems were designed and operated to facilitate management decision making.⁠ ⁠ He managed the application of corporate computing strategies and conducted the implementation of numerous computer systems and was also responsible for computing information infrastructure management on a global scale.⁠ ⁠ He managed computing operations in the following areas: Corporate Six Sigma, computing research & development, computing support for accounting reporting, computing software application design & development, data modeling, business intelligence and analytics, large-scale project management, ERP systems, computing system acquisition integration, computing infrastructure management and virtualization, cybersecurity, IT service management, cloud and software-as-a service, IT organization models, computing leadership/management/people development, and other areas⁠ ⁠ Here at ETSU, Mr. Fraley spearheaded the ETSU-Computing Mentorship Mentoring Program. This program is for computing students and pairs rising second and third year computing students with an IT professional who is active in their field.⁠ ⁠ Mr. Fraley can be found around Nicks and the MC preparing students for the workforce while teaching 3700 - Enabling Business with IS.⁠"
    },
    {
        "document_title": "Lecturer",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/jacob-gillenwater.php",
        "document_content": "Name: Jacob Gillenwater, Title: Lecturer, Email: gillenwaterj@etsu.edu, Phone: 423-439-6970 N/A"
    },
    {
        "document_title": "Lecturer",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/matthew-harrison.php",
        "document_content": "Name: Matthew Harrison, Title: Lecturer, Email: harrisonms1@etsu.edu, Phone: 423-439-5609 Mr. Matthew Harrison is a lecturer in the Department of Computing that primarily teaches systems courses in the Computer Science concentration, including Assembly Language, Computer Systems, Operating Systems, and Computer Architecture. He is working on a PhD at the University of Tennessee, Knoxville, with a focus on heterogeneous memory management in operating systems. Other topic areas that interest him include embedded systems, artificial life, and video game design and development.⁠"
    },
    {
        "document_title": "Instructor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/stephen-hendrix.php",
        "document_content": "Name: Stephen Hendrix, Title: Instructor, Email: hendrixs@etsu.edu, Phone: 423-439-5922 Mr. Stephen Hendrix is the Undergraduate Coordinator and Instructor for the Department of. He received his B.S. and M.S. in Computer and Information Sciences from ETSU in 2003 and 2005. In addition, he received his MBA in 2015 from ETSU. Currently, he is pursuing his Ph.D. in Information Systems, with a focus on Healthcare Information Systems.⁠ ⁠ Mr. Hendrix loves being active in both the ETSU community and his local community of Unicoi County. Currently, Mr. Hendrix has the honor of serving as the President of the ETSU Faculty Senate. In addition, he is blessed to serve Unicoi County as a County Commissioner. ⁠ ⁠ In the Department of Computing, Mr. Hendrix teaches courses in Information Systems and Data Analytics."
    },
    {
        "document_title": "Assistant Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/mohammad-khan.php",
        "document_content": "Name: Mohammad Khan, PhD, Title: Assistant Professor, Email: khanms@etsu.edu, Phone: 423-439-5808 Dr. Mohammad S. Khan is currently an Assistant Professor of Computing at East Tennessee State University and the director of Network Science and Analysis Lab (NSAL). He received his M.Sc. and Ph.D. in Computer Science and Computer Engineering from the University of Louisville, Kentucky, USA, in 2011 and 2013, respectively. His primary area of research is in ad-hoc networks, network tomography, connected vehicles, and wireless sensor networks. He currently serves as an associate editor of IEEE Access, IET ITS, IET WSS and Springer Telecommunication Systems. He has been on technical program committees of various international conferences and technical reviewer of various international journals in his field. He is a senior member of IEEE.⁠ ⁠ Dr. Khan loves to work with students working towards their master thesis or undergraduate thesis. Recently one of his master student was awarded best paper award at an International Conference held in Vancouver Canada. He has edited a book on AI and its applications in COVID-19. Last year he won the research award across the CBAT. He also leads the IEEE Symposium on Computational Intelligence in IoT and Smart Cities (IEEE CIIoT).⁠"
    },
    {
        "document_title": "Lecturer",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/ken-loveday.php",
        "document_content": "Name: Ken Loveday, Title: Lecturer, Email: loveday@etsu.edu, Phone: 423-439-5824 Mr. Ken Loveday joined the ETSU Department of Computing faculty as a Lecturer in 2019. He received his M.S. in Computer Internet Technology from East Tennessee State University. Mr. Loveday acted as web master for his church for eight years.⁠ He also worked at a local commercial pharmacy for two years.⁠ ⁠ ⁠Mr. Loveday was a systems engineer. At the pharmacy where he worked, he took care of the websites, helped manage the server room, and perform general IT troubleshooting. He also took care of his church's website and social media sites. Here at ETSU, he helped manage the ETSU Department of Computing CSCI 1100 program and train the Graduate Assistants that teach CSCI 1100 for two years.⁠"
    },
    {
        "document_title": "Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/phil-pfeiffer.php",
        "document_content": "Name: Phil Pfeiffer, PhD, Title: Professor, Email: phil@etsu.edu, Phone: 423-439-5355 Phil Pfeiffer (M.S./Ph.D., Wisconsin, '86/'91) hails from Pittsburgh, PA, where he was born, grew up, and lived until 1984 before returning to graduate school. This fall, Phil started his 30th year in teaching -- his 25th on ETSU's faculty. Between 1976, when he graduated from Yale (B.S., '76) and 1984, when he started graduate work, Phil programmed for a year for in the Yale Registrar's Office before returning home to work as a programmer/analyst for PPG Industries' Glass Process Control group.⁠ ⁠ Phil did his Ph.D. work in programming languages--a subject that, ironically, he's never been asked to teach. Rather, he's served as a utility guy, teaching courses in introductory programming, file and data structures, data communications and networking, computer architecture, operating systems, real-time programming, information and network security, distributed systems, enterprise information systems, computer literacy, professional issues, cryptography, Unix, XML, and scripting languages. More recently, Phil has taught courses in software project management, software design, technical communication (a.k.a. research methods), and Python, and served as an advisor for graduate capstone projects and graduate and undergraduate theses.⁠ ⁠ When he isn't in front of a computer, Phil makes time for reading, writing to and visiting friends, seeing an occasional movie, listening to all kinds of music, and getting out and about with Linda, his wife of 41 years. The latter includes biking, walking, and scuba, including periodic trips to Gainesville, FL for cave diving.⁠"
    },
    {
        "document_title": "Senior Lecturer",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/jack-ramsey.php",
        "document_content": "Name: Jack Ramsey, Title: Senior Lecturer, Email: ramseyjw@etsu.edu, Phone: 423-439-5807 N/A"
    },
    {
        "document_title": "Lecturer",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/tahsin-rezwana.php",
        "document_content": "Name: Tahsin Rezwana, Title: Lecturer, Email: rezwana@etsu.edu, Phone: 423-439-5385 N/A"
    },
    {
        "document_title": "Lecturer",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/william-rochelle.php",
        "document_content": "Name: William Rochelle, Title: Lecturer, Email: rochellew@etsu.edu, Phone: 423-439-5717 William is a Johnson City/Jonesborough native. He has been a part of the ETSU Department of Computing family since 2014 where he obtained both his bachelor's and master's degrees. In addition to his teaching roles in the department both at-present and during graduate school, he has done work in the Information Security field as well as full-stack web development for local businesses.⁠ ⁠ William now teaches full time for the Department of Computing -- his focus areas include programming fundamentals, server-side web development, database design & implementation, and software engineering. He currently serves on two department committees -- the undergraduate committee and the recruiting committee.⁠ ⁠ Some of his hobbies include gaming, film critique, creative writing, table-top RPGs, and listening to/creating music. He currently serves as the faculty advisor for Dragon's Tavern at ETSU -- an all-inclusive Dungeons & Dragons organization."
    },
    {
        "document_title": "Associate Professor",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/david-tarnoff.php",
        "document_content": "Name: David Tarnoff, Title: Associate Professor, Email: tarnoff@etsu.edu, Phone: 423-439-6404 N/A"
    },
    {
        "document_title": "Clinical Instructor & Director of Using Information Technology",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/christel-young.php",
        "document_content": "Name: Christel Young, EdD, Title: Clinical Instructor & Director of Using Information Technology, Email: youngcd1@etsu.edu, Phone: 423-439-7413 Dr. Young was welcomed as a Clinical Instructor and the Director of Using Information Technology in July 2021!⁠ In this role, Dr. Young manages the CSCI 1100: Using Information Technology curriculum that serves almost 20% of all ETSU enrollments each semester. She brings to the position a wealth of knowledge in engaging, STEM-focused teaching strategies aimed at igniting interest and motivation in students. She also directs the Graduate Assistant Teaching Support (GATS) program, which includes the supervision of over 15 graduate teaching assistants. ⁠ ⁠ Dr. Christel Young received her academic credentials from DePauw University (B.S.), LeTourneau University, Kennesaw State University (M.Ed.), and the American College of Education (Ed.D.). Her research interests include the multi-dimensional impact of housing insecurity on higher education student success and the promotion of equitable educational access among vulnerable populations at the secondary and post-secondary levels. She has authored or co-authored 5 journal articles and book chapters as well as presented at several conferences.⁠ Dr. Young also serves as the Black Faculty and Staff Association (BFSA) Co-President."
    },
    {
        "document_title": "Academic Advisor (Names A-Q)",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/corey-dean.php",
        "document_content": "Name: Corey Dean, Title: Academic Advisor (Names A-Q), Email: deancm2@etsu.edu, Phone: 423-439-6406 Mr. Corey Dean works in the ETSU Department of Computing as the academic advisor for the undergraduate computing students. You can also find him teaching CSCI 1510 - Student in University (CRN: 13857) in Spring 2022.⁠ ⁠ Mr. Dean grew up in the tri-cities area and attended Volunteer High School in Church Hill, TN. He attended King University in Bristol where he obtained a Bachelors in IT as well as an Masters of Business Administration. He is currently pursuing a Graduate Certificate in Data Analytics from the ETSU Department of Computing.⁠"
    },
    {
        "document_title": "System Administrator",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/robert-nielsen.php",
        "document_content": "Name: Robert Nielsen, Title: System Administrator, Email: nielsen@etsu.edu, Phone: 423-439-6967 N/A"
    },
    {
        "document_title": "Academic Advisor (Names R-Z)",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/ryan-oler.php",
        "document_content": "Name: Ryan Oler, Title: Academic Advisor (Names R-Z), Email: olerfr@etsu.edu, Phone: 423-439-7654 N/A"
    },
    {
        "document_title": "Assistant Systems Administrator & PASTA Director",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/david-robinson.php",
        "document_content": "Name: David Robinson, Title: Assistant Systems Administrator & PASTA Director, Email: robinsrd@etsu.edu, Phone: 423-439-7412 N/A"
    },
    {
        "document_title": "Faculty Emeritus",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/gene-bailey.php",
        "document_content": "Name: Gene Bailey, PhD, Title: Faculty Emeritus, Email: baileyg@etsu.edu, Phone: 423-439-5328 N/A"
    },
    {
        "document_title": "Faculty Emeritus",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/martin-barrett.php",
        "document_content": "Name: Martin Barrett, PhD, Title: Faculty Emeritus, Email: barrettm@etsu.edu, Phone: 423-439-5328 N/A"
    },
    {
        "document_title": "Faculty Emeritus",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/terry-countermine.php",
        "document_content": "Name: Terry Countermine, EdD, Title: Faculty Emeritus, Email: counter@etsu.edu, Phone: 423-439-5328 N/A"
    },
    {
        "document_title": "Faculty Emeritus",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/donald-gotterbarn.php",
        "document_content": "Name: Donald Gotterbarn, PhD, Title: Faculty Emeritus, Email: gotterba@etsu.edu, Phone: 423-439-5328 N/A"
    },
    {
        "document_title": "Faculty Emeritus",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/bob-riser.php",
        "document_content": "Name: Bob Riser, Title: Faculty Emeritus, Email: riser@etsu.edu, Phone: 423-439-5328 N/A"
    },
    {
        "document_title": "Faculty Emeritus",
        "document_link": "https://www.etsu.edu/cbat/computing/faculty-staff/suzanne-smith.php",
        "document_content": "Name: Suzanne Smith, PhD, Title: Faculty Emeritus, Email: smits01@etsu.edu, Phone: 423-439-5328 N/A"
    }
]